[
    /*Template*
    {
      "Id": "MyMail",
      "GroupId": null,
      "Title": "My Letter Title",
      "Text": "Hi @, this is a letter!^^-Lewis",
      "Recipe": "Recipe Name",
      "Date": "1 spring Y1",
      "FriendshipConditions": [
        {
          "NpcName": "Lewis",
          "FriendshipLevel": 2
        }
      ]
    },
    /*SENDING RECIPES*/
    /*Kitty Muffin: Sterling, 7 heart gift */
    /*Bear Muffin:  Sterling, 250k gift */
   /*Mia*/
    {
      "Id": "arv.bearpancakes",
      "Title": "Mia's Famous Bear Pancakes!",
      "Text": "Dear @,^The boys tell me they've told you quite a bit about my bear pancakes. I'm sure I've mentioned them plenty too Well, I was thinking of you while I made some this morning, so I figured I'd write you my recipe so you can enjoy it as well! Don't worry, I'll still make some extra for you when you swing by the house. ^^(Ps, if you need any help getting the shapes down^don't hesitate to come see me, I'd be happy to help!)^-Mia",
      "Recipe": "Bear Pancakes",
      "LetterBG": "MiaLetter.png",
      "Repeatable": false,
      "FriendshipConditions": [
        {
          "NpcName": "Mia",
          "FriendshipLevel": 4
        }
      ]
    },
      {
        "Id": "arv.cattoast",
        "Title": "Mia's Morning Treat",
        "Text": "Dear @, I hope you're not pushing yourself too hard on your farm! It's a sweet toast kind of morning, so I thought I'd send you the recipe of one of my favorite treats so that you could enjoy as well. Why don't you take a break and visit me at the house so I may make it for you too?^^-With much love,^Mia!",
        "Recipe": "Morning Cat Toast",
        "LetterBG": "MiaLetter.png",
        "Repeatable": false,
        "FriendshipConditions": [
            {
            "NpcName": "Mia",
            "FriendshipLevel": 6
            }
        ]
      },
      {
        "Id": "arv.crabcroissant",
        "Title": "A Fun Breakfast Experiment!",
        "Text": "",
        "Recipe": "Crab Croissant",
        "LetterBG": "MiaLetter.png",
        "Repeatable": false,
        "FriendshipConditions": [
          {
            "NpcName": "Mia",
            "FriendshipLevel": 6
          }
        ]
      },
      {
        "Id": "arv.froggyburger",
        "Title": "I find you RIBBITing!",
        "Text": "Dear @,^I've come to realize I don't find cooking as satisfying when I don't pour all my creativity on it. I wanted to make something special today, so I settled on a Froggy Burger! It was a great success with the boys, so I immediately set to write you the recipe. Maybe to impress a future beau...? (Or a child, both seem to work with equal efficiency!)^^With much much love,^-Mia",
        "Recipe": "Froggy Burger",
        "LetterBG": "MiaLetter.png",
        "Repeatable": false,
        "StatsConditions": 
        [
            {
        "StatsName": "IndividualMoneyEarned",
        "Amount": 75000 
            }
        ]
      },
      {
        "Id": "arv.owlricecrisp",
        "Title": "A treat for Eloise",
        "Text": "Hi, @!^How's the valley treating you? I assume you've made many friends by now. Have you gotten to spend some time talking with the kids though? If they seem pretty cold to you, I've written you a recipe for one of their favorite snacks. Eloise specially loves it! We make them together sometimes, so maybe it could be something to bond over?^Remember to keep hydrated during the summer!^^With love,^-Mia",
        "Recipe": "Owl Rice Crisp",
        "LetterBG": "MiaLetter.png",
        "Repeatable": false,
        "Date": "5 summer Y2"

      },
      {
        "Id": "arv.berryparfait",
        "Title": "Sterling's Fruity Delight",
        "Text": "Hey @!^Sorry if this is rather random. I've been seeing Mia write letters with the kids and I thought it might be fun trying it out, so here we are! I keep having to erase every 2 words because it feels like my handwriting is so terrible, so please forgive it.^^I hope you're doing well at the farm! Be sure to talk to me whenever you go to Pierre's, as you're always a highlight of my day. As thank you, I wanted to write you a recipe for this fruit parfait I used to make when I was younger. No cranberries though ;P ^Be sure to think of me while you enjoy it ;) ^^-Sterling",
        "Recipe": "Berry Parfait",
        "Repeatable": false,
        "Date": "1 summer Y1",
        "FriendshipConditions": [
          {
            "NpcName": "Sterling",
            "FriendshipLevel": 4
          }
        ]
        
      },
      {
        "Id": "arv.kittymuffin",
        "Title": "Sterling's Pawsom Delights!",
        "Text": "Hey,@!^Finally decided to give baking with Mia a try, so I thought I could PURRhaps interest you in the result? I KNEAD you to try out this A-MEW-SING recipe we just made. I'm very fur-tunate to have you as a friend, so if you're FELINE sad, just try out these Kitty Muffins and let them WHISKER you away!^^Your FUR-midable friend,^-Sterling",
        "Recipe": "Kitty Muffin",
        "Repeatable": false,
        "FriendshipConditions": [
          {
            "NpcName": "Sterling",
            "FriendshipLevel": 8
          },
        ],
        "EventsSeen": [401800010]
        
      },
      {
        "Id": "arv.bearmuffin",
        "Title": "Sterling's unBEARably good muffins.",
        "Text": "Dear @,^Do you know what the bear said to their spouse bear on their wedding day? I can’t wait to growl old with you! Thinking of that, I wanted to send you my new favorite treat. I made them with my BEAR hands! The details are quite finnicky to get right, but nothing is imPAWsible, if you set your mind to it. I think you're more than KOALAfied for the job!^^Appreciate you furever,^-Sterling",
        "Recipe": "Bear Muffin",
        "Repeatable": false,
        "StatsConditions": // Each stats of the list must have a value equal or higher what is defined. Choose a StatsName or a StatsLabel
        [
            {
        "StatsName": "IndividualMoneyEarned",
        "Amount": 250000
            }
        ],
  
      },
      {
        "Id": "arv.berrydelights",
        "Title": "A Thank You from the Coopers",
        "Text": "Dear @,^Just last night we were reflecting on our time spent with you, and all the wonderful things that have come from it since you've arrived in the valley. Truth be told, we were all outsiders in our small, little ways; but even though you too were a fish out of water when you arrived in valley, you still took the time to extend a friendly hand out to Sterling as he struggled with moving on. You baked with Mia on quiet nights when it felt like her world was crashing down, and you offered Henry a helping hand to realize he'd been his own worst enemy. ^In many ways, none of us would be the same if you'd never come, and for that, we are all forever grateful for your friendship.^As we thought of you, we decided to write you a recipe for one of our favorite treats. It has a little bit of all of us in it, just as we have a little bit of you in us. We hope that you can enjoy it, and have many better years to come in the valley.^^Sincerely, - Sterling, Henry and Mia.^",
        "Recipe": "Berry Delight",
        "LetterBG": "MiaLetter.png",
        "Repeatable": false,
        "FriendshipConditions": // Each NPC of the list must check all conditions.
        [
            {
                "NpcName": "Mia", //Name of the NPC. Can use custom NPCs.
                "FriendshipLevel": 8, // NPC must have a friendship heart level equal or higher what is defined. Default is 0.
            },
            {
                "NpcName": "Sterling", //Name of the NPC. Can use custom NPCs.
                "FriendshipLevel": 8, // NPC must have a friendship heart level equal or higher what is defined. Default is 0.
            },
            {
                "NpcName": "Henry", //Name of the NPC. Can use custom NPCs.
                "FriendshipLevel": 8, // NPC must have a friendship heart level equal or higher what is defined. Default is 0.
            }
        ],
      },
      {
        "Id": "arv.plaincroissant",
        "Title": "A Farmer's Practical Breakfast.",
        "Text": "Dear @,^I don’t really get much time to visit with the townsfolk, so it means a lot that you’ve gone out of your way to spend time with me. It’s not much, but I wanted to share this recipe with you as a token of my thanks. I’m not much of a cook, so I can’t do much with it. But maybe you’ll do better.^^-Henry Cooper",
        "Recipe": "Plain Croissant",
        "Repeatable": false,
        "FriendshipConditions": [
          {
            "NpcName": "Henry",
            "FriendshipLevel": 4
          }
        ]
      },
      {
        "Id": "arv.scallopedpotatoes",
        "Title": "Grandma Cooper's Special",
        "Text": "Dear @,^So you probably know by now that I’m not much of a cook. But there’s one recipe that I’ve worked my heart out trying to master. It’s a family dish that has been perfected over generations, a real staple of springtime. And since you’ve been such a good friend, I thought I would give you a chance to try it for yourself. Hope you like it.^^Your friend,^Henry Cooper",
        "Recipe": "Scalloped Potatoes",
        "Repeatable": false,
        "FriendshipConditions": [
          {
            "NpcName": "Henry",
            "FriendshipLevel": 8
          }
        ]
      },
    /*GENERIC DIALOGUE*/
    /* Mia*/
    /* Mia Welcome*/
    {
      "Id": "arv.miawelcome",
      "Title": "Welcome to the Valley!",
      "Text": "Hi, @!^I just heard you moved from the townsfolk, so I wanted to officially welcome you into the valley!^^ My name is Mia, and I'm one of your fellow neighbors. Why don't you come over sometime? Sterling, Henry and I live over at East Scarpe, and we'd be happy to have you. I love having guests over for lunch! But as I'm sure you're very busy, I've enclosed a treat for you. ^^I hope to see you soon! ^-Mia.",
      "Attachments": [
          {
        "Type": "Object",
        "Name": "Bear Pancakes",
        "Stack": 1
      }
    ],
      "LetterBG": "MiaLetter.png",
      "Date": "7 spring Y1"
    },
    /*Mia Summer*/
    {
      "Id": "arv.miasummer",
      "Title": "Mia's Reminder to Hydrate",
      "Text": "Dear, @!^^Have you noticed the time? It's summer! Of course, that means it's melon season. But most importantly, it means you need to make sure you're staying hydrated! At home, that is my biggest challenge with the Cooper boys. However, to this day nothing beats a good drink of my Summer Pink Lemonade. I'll be attaching you some for you to try.^^Be sure to stay hydrated!^-Mia.",
      "Attachments": [
          {
        "Type": "Object",
        "Name": "Summer Pink Lemonade",
        "Stack": 1
      }
    ],
      "LetterBG": "MiaLetter.png",
      "Date": "5 summer Y1"
    },
    /*Mia Summer Y2*/
    {
      "Id": "arv.miasummery2",
      "Title": "Mia's Summer Reminder",
      "Text": "Dear, @!^^Summer is upon us! You know what that means? My great quest for hydration resumes once more, and you're my next victim.^^I've attached a few cups for you to enjoy this year as I'm sure you're ramping up production at the farm. Please enjoy it!^^Be sure to stay hydrated!^-Mia.",
      "Attachments": [
          {
        "Type": "Object",
        "Name": "Summer Pink Lemonade",
        "Stack": 3
      }
    ],
      "LetterBG": "MiaLetter.png",
      "Date": "3 summer Y2"
    },


    /* Henry*/
    /*Henry Welcome*/
    {
      "Id": "arv.henrywelcome",
      "Title": "Henry's Welcome",
      "Text": "Dear @,^It was nice to meet a fellow farmer. I was worried your grandpa's farmland would go to waste, but I'm glad it's going to be in good hands now. It's not much, but I wanted to give you a little something to get you started. Hope it helps.^^-Henry Cooper",
      "Attachments": [{
        "Type": "Object",
        "Index": 369,
        "Stack": 3
      } ],
      "FriendshipConditions": [
        {
          "NpcName": "Henry",
          "FriendshipStatus": ["Friendly"]
        }
      ]
    },
    //Sterling
    /*Sterling Bike Ride*/

    {
    "Id": "arv.sterlingbike",
    "Title": "A Special Afternoon",
    "Text": "Dear, @.^After Mia successfully wrangled me into telling her why I've been feeling so thankful and happy, she suggested I try to put my feelings into words. It's a lot harder than it looks like, haha.^But I guess what I'm trying to say is... Thank you. For coming with me and talking to me. I don't get to connect with people like that often.^^Stay safe AND hot, alright farmer?^-Sterling",
    "EventsSeen": [40180006]
    },

    /*Dinner Invite*/
    {
    "Id": "arv.sterlingdinner",
    "Title": "Dinner at the Cooper Home",
    "Text": "Dear, @.^After trying to make it up to everyone as best as I could, I've spent the past few weeks wondering how to try and apologize to you. For what happened at Pierre's shop, for my attitude, for disappointing you if I did. It's been a long process, but I can at least start by saying I'm sorry, and I'll work so my actions can show that too.^^I wanted to invite you to dinner at the house, with Henry, Mia and me. As a family. Swing by the house after 6, alright?^^With love,^Sterling.",
    "FriendshipConditions": 
    [
        {
            "NpcName": "Sterling", 
            "FriendshipLevel": 8, 
        },
    ],
    "EventsSeen": [40180009]
  },

  /*Sterling Birthday Share*/
  {
    "Id": "arv.sterlingbirthdayy2",
    "Title": "It's My Birthday!",
    "Text": "Dear, @!^^Guess what? It's my birthday! After finding out how amazing it is to celebrate it with the people you love, I decided to extend the celebration over to you! Here's some of the cupcakes Mia and I baked. Don't eat them all at once, alright?^^Yours Truly On A Sugar Rush High,^Sterling.",
    "Attachments": [
        {
      "Type": "Object",
      "Name": "Kitty Muffin",
      "Stack": 3
    }
  ],
    "Date": "15 summer Y2"
  },
    
]