{
"Changes": 
    [
        {
    "LogName": "Mia Dialogue",
    "Action": "EditData",
    "Target": "Characters/Dialogue/Mia",
    "Entries": 	
    {
//Conversation Topics

    "Introduction": "Ah! Farmer, @, isn't it? It's so nice to meet you.#$b#The town has been buzzing with your arrival, I hope they haven't been too hard on you.#$b#Don't hesitate to swing by if there's anything you need to settle down.",
	"danceRejection": "I appreciate the offer, but I've already promised Henry a dance this year.#$b#I'll save you next year's for you, for sure!",
    "divorced": "Listen, @. I like my home here, alright? The place, the people, they're important to me.#$b#I refuse to let you ruin that for me, so I will ask you one more time to leave me alone. I don't want to be forced back to the city.",
    "breakUp": "O-Oh#$b#Is that really how you feel? I see...#$b#Best of luck to you, @. I'm sorry for assuming there was something more going between us.",
    "dumped_Girls": "You were my first! The first person I allowed this close, my first love, my first relationship...#$b#And now my first disappointment. You're a cheat, @, a cheat and a pig.",
    "secondChance_girls": "Don't break my heart again, @. I love you, and I choose to trust you.#$b#Just don't take my forgiveness for granted... I want to move on and hold you as much as you do.",

//Special Dates

    "spring_12": "I've been making bunny shaped chocolate surprises for the kids all day!$1#$b#They adore the Egg Festival, so I always try to make memorable treats for them.",
    "spring_23": "Have you pulled your suit from the closet for tomorrow?^Have you pulled your dress for tomorrow from the closet?#$b#I've been ironing the boys' suits for tomorrow. They tell me it's unnecessary, but I want them to look dashing if they decide to dance!$3",
    "spring_27": "Ah! I can not wait for the summer, the ocean is always so pleasant in the valley.$1#$b#I know for a fact Haley feels the same.$0",
    "summer_10": "I've been thinking all day about what I want to take to the Luau. Do you know what you're taking already?#$e#Probably some chilis I grew in the garden.$3",
    "summer_15": "Farmer! Did you know it's Sterling's birthday today?#$b#He's been a bit lonely since leaving behind his friends in the city, you should drop by and bring him a gift!#$b#It'd make him very happy.$1",
    "summer_27": "I'm so excited for the Moonlight jellies. They're such a rare species that it's hard to spot them anywhere outside Stardew Valley.#$b#My dad took me to see them to a museum once. I knew I had to seem them in person since.",
    "fall_15": "Will you be setting up a grange display this year?#$b#My! Pierre is going to have some amazing competition.#$e#Don't tell Lewis, but I'm rooting for you @.",  
    "fall_23": "Oh, @! Did you hear it's Henry's birthday today?$1#$b#You should go seem him, he'd love to see you today!",
    "fall_26": "What are you dressing up as for Spirit's Eve?#$b#I hope you like celebrating it. In this house we like getting spooky.",
    "winter_15": "I'll take the existence of mermaids from Eloise, but if I have to hear Sterling trying to convince me one more time-#$b#I may just go insane!#$e#I find the costumes they use for the mermaid show gorgeous, however.",
    "winter_16": "Did you see today's Painter Lupini original?#$b#My dad had a private collection hung in our home growing up.#$e#I think they're a bit overrated.",
    "winter_17": "Don't be listening to Sterling, I'm perfectly capable of controlling myself.#$b#The only one with a problem is him and his inability to see a good thing when it bites him.#$e#... Those are the most gorgeous lawn decorations I have seen-",
    "winter_24": "I love the food at the festivals, but there's no treat I enjoy more than the meal prepared for Winter Star.#$e#I've spent all day roasting a honey glazed ham for it.",
    "winter_28": "Oh my, the year sure has snuck up on us? Hasn't it?#$b#It's good to have you around, @. I hope for many good years to come with you as well.",

 
//Daily Dialogue
    "spring_Mon": "Hey farmer! Are you growing any interesting flowers this season?",
    "spring_Mon2":"",
    "spring_Mon4": "",
    "spring_Mon6": "",
    "spring_Mon8": "",
    "spring_Mon10": "",
    "spring_Tue": "It's very important doing our best to stay healthy.#$b#Thankfully, it's easy to eat fresh and organic with all the wonderful crops grown around the valley.#$e#You should come have some lunch with us one of these days!",
    "spring_Tue2": "",
    "spring_Tue4": "",
    "spring_Tue6": "",
    "spring_Tue8": "",
    "spring_Tue10": "",
    "spring_Wed": "Aerobics is a great way to make sure I keep in shape without all the gyms from the city.#$b#You should try joining us for class sometime, I'm sure the girls would love to have you.#$e#I'm sure you keep in great shape with the farm regardless.",
    "spring_Wed2": "",
    "spring_Wed4": "",
    "spring_Wed6": "",
    "spring_Wed8": "",
    "spring_Wed10": "", 
    "spring_Thu": "Have you checked out the garden Henry and I keep at the back? It's my pride and joy.#$e#If Sterling asked, you can tell him I said he helped too.",
    "spring_Thu2": "",
    "spring_Thu4": "",
    "spring_Thu6": "",
    "spring_Thu8": "",
    "spring_Thu10": "",
    "spring_Fri": "Hey, farmer! Are you looking for Sterling? You can find him working at Pierre's most of the week.",
    "spring_Fri2": "",
    "spring_Fri4": "",
    "spring_Fri6": "",
    "spring_Fri8": "",
    "spring_Fri10": "",
    "spring_Sat": "I've been learning how to cut fruit into fun little shapes. Would you like to try one?#$b#See, this one is supposed to be a small bear.#$e#Guess it could pass for Mickey mouse easier...",
    "spring_Sat2": "",
    "spring_Sat4": "",
    "spring_Sat6": "",
    "spring_Sat8": "",
    "spring_Sat10": "",
    "spring_Sun": "I hope you're at least taking Sundays off, @. It's important to get some rest.$1#$e#I certainly try, but with the two boys liking to drink their Sundays away, someone needs to keep control of the house.",
    "spring_Sun2": "",
    "spring_Sun4": "",
    "spring_Sun6": "",
    "spring_Sun8": "",
    "spring_Sun10": "",
    "summer_Mon": "Have you dipped your toes into the East Scarpe beach? I find it's a little less crowded than the main one, but certainly as beautiful.#$e#Eloise mentioned having seen a mermaid at the tide pools last time I took her.",
    "summer_Mon2": "",
    "summer_Mon4": "",
    "summer_Mon6": "",
    "summer_Mon8": "",
    "summer_Mon10": "",
    "summer_Tue": "Melons are certainly my favorite crop to grow during the summer, they make for the most wonderful cakes.#$e#Here! Taste some of my produce.$1",
    "summer_Tue2": "",
    "summer_Tue4": "",
    "summer_Tue6": "",
    "summer_Tue8": "",
    "summer_Tue10": "",
    "summer_Wed": "I'm trying to get the boys to head to the beach with me today!#$b#I like organizing things during Sterling's days off.",
    "summer_Thu": "I moved to the valley at least a few seasons ago. Born and raised in Gallus city, proud home city to the Gallus Wildebeasts!#$b#My dad and I have never missed a single game; though Alex would probably chew my head off if he heard me say that.",
    "summer_Fri": "Hey farmer look!#$b#I made some cat shaped biscuits today, would you like to try some?#$e#Saved you a few, Sterling and Henry almost gobbled all of them in one sitting.",
    "summer_Sat": "Summers are so hot in the valley... I hope you're keeping properly hydrated!",
    "summer_Sun": "I swear to god, I feel like I'm raising kids sometimes.#$b#It's so hard to get Sterling and Henry to drink 8 cups of a water a day unless half of those are lemonade. Be sure to drink plenty of water yourself, @.#$e#... Even Jas and Eloise are so much more well behaved...$7",
    "fall_Mon": "I'm baking pumpkin pie today!#$b#Ordered a Hibiscus shaped pan on E-mazon that I've been dying to use for this.#$e#Do you think Henry will like it?$4",
    "fall_Tue": "My job is what actually let's me stay at home for the long periods I do.#$b#I help a company oversee their carbon cropping and crop sustainability in Grampleton. To an industrial level, of course.#$b#Let's me spend long periods home, and others in Grampleton at a time.#$e#Pretty sweet deal!$3",
    "fall_Wed": "Made some pancakes this morning, with some fresh grapy jelly from your produce!#$b#It's actually Sterling's favorite breakfast. You can try feeding him some pancakes yourself if you wat to make him REALLY happy.",
    "fall_Thu": "I've always wanted a family of my own, but getting to baby sit Eloise and Jas from time to time certainly soothes the baby fever.#$e#And babysitting Henry and Sterling too, if you count them as well.",
    "fall_Fri": "It is fall and I'm throwing pumpkin spice on literally EVERYTHING.#$b#Nobody is going to stop me THIS IS MY TIME.$5",
    "fall_Sat": "I actually got to study agronomy at the Ferngill capital. Wrote my thesis in Farisia, and now work in Grampleton!#$b#My little garden keeps me occupied when I'm not working.$1",
    "fall_Sun": "... One day, I want to have a farm of my own.#$b#Plant a whole field of sunflowers, and bask in it's wonderful yellow...$4#$e#Sorry, @, just daydreaming out loud.$1",
    "winter_Mon": "Henry and I met in Farisia a few years ago. I was working on my thesis, and he had some family there he was helping out.#$b#I got to show him around Gallus City before we settled back into the valley, Sterling only moved in recently.",
    "winter_Tue": "Granny Evelyn was kind enough to drop some cranberry jelly she made.#$b#I had to end up gifting it to Jacob, Sterling is incredibly allergic and I don't want to risk having it around...#$b#I certainly wouldn't try gifting him anything cranberry.",
    "winter_Wed":"I love it when it snows in the valley! It's a bit too cold to have tea outside with Aideen, but we make do with some hot drinks at her place.",
    "winter_Thu": "Just how much wear and tear do you think two grown men are capable of?#$b#Way too much! I'm spending most of today mending little holes.#$e#Thankfully, Henry helps.$5",
    "winter_Fri": "Do you think you could check up on Sterling at the Saloon?#$b#He tends to drink his entire Fridays away and loses track of time...$6#$e#Or becomes a public nuisance in the worst case scenario...$7",
    "winter_Sat": "Did you see what Aideen was wearing today? Her dresses are so gorgeous, as usual!$1#$b#Sometimes I wonder if I should just throw away my own societal inhibitions and parade around in my own indulgent gowns.$4",
    "winter_Sun": "Jacob is so kind. Max got into my chocolate late last night and we had to end up waking him in the middle of the night.#$b#He's all fine now, don't worry about it. But he certianly scared us.",
  
    }
        }
    ]
}