{
"Changes": 
	[

		{
    "LogName": "Sterling Dialogue",
    "Action": "EditData",
    "Target": "Characters/Dialogue/Sterling",
    "Entries": 	
{
	"Introduction": "Oh hey. You're new here, aren't you?#$b# The name's Sterling, I moved here not too long ago myself.$h#$b#Maybe it'll give us something to talk about over some beers. First one's on me, alright?#$b#See you around.$h",
	"danceRejection": "Oh! That's pretty sweet of you to ask.#$b#I kind of have two left feet though, I'll have to pass.$3",
    "divorced": "Oh NOW you want to 'communicate?$5#$b#Buzz off, you threw away all your chances.$8",
    "breakUp": "I... W-Wait, what?$11#$b#God I'm such an idiot, aren't I? Thinking I could actually have do better for once.$8#$b#It's whatever, enjoy yourself, @. You deserve a good life.$5",
    "dumped_Guys": "You're disgusting, @. And exactly the sort of person I moved from the city for.$8#$b#It's great to know that no matter where I am, all I do is get drawn to trash.$8",
    "secondChance_Guys": "Man... I guess I'm a true addict, aren't I?#$b#Just can't keep away from my own addictions...$4#$e#Just don't... Screw it up this time, okay? This is my home, I don't want to lose it too.$11",

//ENTRIES
	"SeedShop_Entry": "{{Random:*yaaaawn* Mornin' boss.++Think we can get some air conditioning?++Remind me why I still work retail...?++Looking mighty cheap, Pierre!++Is today the day I get my raise? No?++Morning boss.++New day, more shelves to stock.|inputSeparator=++}}",

//CONVERSATION TOPICS

   	"spring_Sun_inlaw_Henry":"I'm so happy Henry is away from his family and putting all that energy into a much more prosperous farm.#$b#We do miss having him around but there's nothing better than my uncle getting salty over not having his beating bag anymore.$10#$b#Take good care of him, aight?",
	"spring_Sun_inlaw_Mia":"It's really weird it being Henry and I all over again. Then again, I guess this is how it was since we were children.#$b#Take good care of her, aye farmer?",	

//SPECIAL DATES    

    "spring_5_1": "Let me guess, your parsnips were ready today?$10#$e#The spring seeds are right down the aisle.$1",   
	"spring_12": "You're so lucky they let you participate in the egg festival.$10#$b#I've always wanted to do the egg hunt but Lewis says I'm too old.$9#$b# Bummer. Better win for me.$10",
	"spring_23_2": "Flower dance is tomorrow. Have you been brushing up your steps?#$b#You better be thinking of asking me to dance, I'll be disappointed otherwise.$10",
	"spring_20": "Have you seen Shane today just yet?$9#$e#It's his birthday, you should totally buy him a beer and see how he blushes.",
	"spring_27": "Summer's just around the corner.#$b# Soon you ain't going to be the only hot stuff around the valley.$10",
	"summer_10": "Man I can't wait to get stuffed tomorrow.$1#$e#... What?$9#$e#Okay, and celebrate the summer with everyone else, sure.$0#$e#Don't say it like YOU don't look forwards to the food too.$9",
	"summer_14": "Ah, I can't believe my birthday is already around the corner...$3#$e#I'm so used to just drinking them away in the city, but I know Henry and Mia will want to celebrate it.$11",
	"summer_27": "I wish the Dance of the Moonlight jellies included actual dancing.#$e#Nothing much more romantic than dancing in the moonlight with someone you love.$1",
	"fall_15": "Are you excited for the Fair tomorrow?$1#$b#We don't really set up a stall here because we participate in Grampleton's fair.",  
	"fall_23": "You should go see Henry today.$1#$b#It's his birthday today, he gets so flustered when you congratulate him.#$e#Mia's planning on throwing him a party in the afternoon.",
	"fall_26": "Hey, @. You about ready to get spooky?",
	"winter_7": "Are you any good with the fishing pole, farmer?#$e#Well you better be putting out your A game for the festival tomorrow.$10#$e#Ehh... I'm better with other poles if you catch my drift.",
    "winter_15": "Hey, dollface. Have you ever seen the mermaid swimming up the dock during the Night market?#$b#Mia thinks I'm insane, but I know you have my back and believe me.$9",
    "winter_16": "Do you think the merchant puts anything in her coffee?$6#$e#I swear it tastes like...*mumble*$12",
    "winter_17": "Henry and I take turns watching Mia during the market.#$b#She tends to go crazy with the shopping. Then we can't fit anything at home.$3#$e#Rich city folk have the weirdest habits...$3",
	"winter_24": "So who did ya get for the gift exchange?#$b#Wait, don't tell me. Lewis is going to yell at me if I find out.$1",
	"winter_28": "Can you believe the year has flown by already?#$b#I'm not exactly excited to be getting any older, but I'll definitely toast to new experiences and adventures next year.$10",

	//Resort

    "Resort_Entering": "Sun, sand, cocktails, here we go!#$b#Can't believe it took me this long to convince Henry to give this place a try. The valley sure has it all!$h",
    "Resort_Leaving": "Bah! What's a man gotta do for a few extra hours in the day?$12#$b#I was debating the merits of camping under a palm tree and stargazing earlier. But it's way too cold and I didn't come prepared.$h#$b#Next time.",
    "Resort_Shore": "@ ! Have you tried the water just yet? It's so good to go for a swim!$15",
    "Resort_Umbrella": "Mia said to be careful being under the sun without sunscreen for prolonged periods of time.#$b#Her heart's in the right place, but not all of us are white as a sheet and redden like a tomato from a little UV light.$9",
    "Resort_Wander": "Do you think humans are actually capable of opening coconuts with their bare hands?$h#$b#I tried earlier. Did not work.#3",
	"Resort_Wander_2": "I haven't been to the beach in so long! Moving to the valley was the best thing I could've ever done.",
    "Resort_Chair": "Do you think humans are actually capable of opening coconuts with their bare hands?$h#$b#I tried earlier. Did not work.#3",
    "Resort_Bar": "Nothing better to lay back and enjoy the sun than a good drink.#$b#You should try Gus' virgin pina coladas, dollface.$10",
	"Resort_Towel": "Won't you come sunbathe with me a little, farmer? Watch the others get trampled by the waves.",
	"Resort_Towel_2": "Do you have a sunburn, or are you always this hot, poppet?",
	"Resort_Towel_3": "If I build a sandcastle will you be my king?^If I build a sandcastle will you be my queen?",
    "Resort": "Is this where you ended up moving, @?$h#$b#Without inviting me?!$10#$b#This place truly is a paradise, you might end up having to clear up a space for me in your house.$10",

	"give_flowersA": "... These are for me?$11#$b#I... I don't think I've ever gotten flowers before, I--$4#$b#Nothing would make me happier than going out with you, @. I think I must be dreaming, I've never been this happy.$9#$e#Have I really been that daft not asking you out sooner? Sheesh. So glad you did.$10",
	"give_flowersB": ".... @ ! $7#$b#These are for me? I can't believe you'd try and beat me to asking you out.$1#$b#%Sterling presents you with a bouquet of flowers of his own#$b#I suppose this means a yes from the both of us? $4",
	"give_pendant": "You're proposing?$7#$b# ...@... I.... This is the happiest day of my life.$4#$b#I'm sorry, I'm trying not to cry. I do! I do! There's nothing I'd love more than spending the rest of my life with you.#$e#I need to go Henry, and Mia, call the whole town! There's so much to do, babycakes!",
	"stardrop_gift": "Good morning, angel. I heard how much you enjoy these so, I went ahead and ordered one a few weeks back. They were surprisingly hard to procure.#$b#My moon, my stars. I hope you can take this as a token of my love. You make me the luckiest man alive.$4",
	"reject_two_heartA": "Uh... Sorry sunshine, I don't really do relationships.$3#$e#Sorry if I gave you the wrong idea dude.",
	"reject_two_heartB": "... Uhh, I'm flattered? Unfortunately me and love don't quite see eye to eye. I'm sure there's plenty of other nice guys out there, babycakes. $3",
	"reject_four_heartA": "Look, you're incredibly cute and all darling. And I really enjoy hitting it off with you but... I can't do relationships right now.$5#$e#Not after Kai... I don't ever want to be that toxic person again. Not to you. Never to you.$12",
	"reject_four_heartB": "This is... I, I'm sorry farmer. I'm really not ready for this sort of thing.$12#$e#I had a relationship before I came to the valley, I screwed that up royally. I can't do that again. I like it too much here.$12#$e#Please don't become the reason I need to run away again.$5",
	"engageA": "Holy shit, @. Aren't you engaged? You're fucking disgusting.$8#$e#Leave me alone before I change my mind and go tell your spouse.$8",
	"engageB": "Dude didn't we just celebrate your engagement? You're sick. Your wedding is literally in a few days.$8",
	"marriedA": "... $5#$b#Am I a fucking joke to you, @? $5#$b#You people are all the same. In the city, out here. I thought I could get away from the garbage reek that are the likes of you but I guess I was wrong.$5#$e#Don't talk to me, you're disgusting.$8",
	"marriedB": "I hope this is some sort of miserable sick joke, because I'm not laughing.$5#$b#Do you have a better joke for me farmer? Or am I the fucking joke to you?$8",
	"refusal_no_heartsA": "Oh hey! It's been years since I've seen a mermaid pendant. Is it for a special someone, farmer?",
	"refusal_no_heartsB": "On your way to deliver that to a special someone, I hope? I better get a wedding invite.$9",
	"refusal_knownA": "Uhh... I'm quite flattered, babycakes. But I literally just arrived in town, got out of a toxic relationship, uprooted my entire life? Remember?$3#$b#Definitely nowhere near considering marrying a total stranger.$3#$e#Feel free to try again when I'm not sober.$10",
	"refusal_knownB": "Sorry darling, me and the idea of marriage just ain't meshing at the moment. No matter how cute you might be, or weirdly adorable this random proposal might be.$6",
	"refusal_botherA": "This isn't exactly funny anymore, farmer. I'm genuinely just trying to better myself, I don't really need this right now.$5",
	"refusal_botherB": "Please drop it, it was cute the first time but this is rather frustrating. I'm trying really hard to set the boundaries thing.$5",
	"giftquestion_yes": "Oh that's sweet of you. I hope they can enjoy it.",
	"giftquestion_lie": "... Hey, I... My last relationship was difficult, you know? A lot of mistakes, mistrust, constant screwing up on both our parts. I was someone nasty I never want to be anymore.$2#$b#I never want to go back to that. Not us. All I ask is you tell me the truth next time.$2",

//Conversation Topics 
	"joja_Begin": "Did you see the old community center being gone?$2#$e#Henry and I used to play in there in the afternoons right after school. Peek inside the library and sit in plush cushions on the ground during celebrations.$2#$b#Shame that's gone forever. I guess you really don't really get things back when you leave them. I took too long to come back.",
	"cc_Begin":"Farmer! You're helping rebuild the Community Center? That's so wonderful I could just kiss you!$1#$b#I'll be sure to try and help as best as  I can. Mia and Henry surely will too. These are such exciting news!#$e#Henry and I haven't gotten to play in there since we were dumb lads.$9",
	"cc_Bus":"Oi farmer! I heard you repaired the bus. Can't believe I can finally go visit Zuzu again if I want to.#$b#You should let me take you for some crepes one of these days as thank you.",
	"cc_Minecart":"Heard the minecarts started working again. I'm sure that'll be such a huge help to Clint.#$b#Maybe it'll help him lighten up a little already.$10",
	"cc_Complete": "Man, I had not seen the village this happy and thriving since before I moved out. It's...#$b#So refreshing. I'm happy for everybody. Thank you so much, farmer.$4",
	"movieTheater": "Farmer! You'll have to let me take you out for a movie one of these days. I can't believe there's finally something fun to do in town. $9",

    
//LOCATIONAL DIALOGUE   

	"Saloon": "I love the valley, but this place actually feels like home.$1#$b#Cheap booze? Lame ambience? If I close my eyes, it's almost like I'm back in Zuzu City.$0.",
  	"Saloon4": "I'm glad to be out of the house tonight, Mia and Henry deserve the time alone.#$b#They're incredibly nice to let me stay at their place, I don't want to push their goodwill.$8#$b#It's not like they've said anything, no. But what if they do eventually?$11#$b#Everyone does eventually.$5",
  	"Saloon6": "Mia doesn't really like that I drink this much.$11#$b#We had a fight about it before I came here.$8#$b# To be honest, I feel bad about it. I'm just tired of women thinking they can fix me.$11#$b#...I'll probably apologize when I get home. Thank you for listening.$11",
  	"Saloon_Fri": "Henry's such a stiff, but I finally got him to accompany me to the Saloon.$9#$b#You should go say hi, I'm sure he'd like you.$9#$b#You should ask him to dance if you dare, I'll bet you he'll get red.$10",
  	"Saloon_Fri2": "Do you know how much does a polar bear weigh?#$b#I really don't know either but it breaks the ice. Wanna get a drink?$10",
	"Saloon_Thu6": "Is there a lucky someone in your life, farmer?#$b#There's been a few in my own life, though I'd say lucky is the operating word. I'd guess it's a bad combination of attracting toxic people when you're a bit of a toxic person yourself.#$b#...$2#$b#Sorry, just thinking about my ex. He was a really nice guy, broke up with him before I moved to the valley. It was honestly for the best, the best thing I could do for him that is.",  
  	"Saloon_Fri4": "What's up farmer! Have a drink on me.$10#$b# You're always free to hang out with me and Shane, he thinks you're cute.$10",
  	"Saloon_Fri6": "Well I'll be damned, farmer. They say Disney is the happiest place on earth. Well apparently, no one has ever been standing next to you.$10#$b#%Shane grumbles next to Sterling.",
  	"Saloon_Fri8": "I'll be darned, farmer! I was blinded by your beauty; I'm going to need your name and phone number for insurance purposes.$10#$b#You ought to get used to the pickup lines, they're only gonna get worse the longer you know me.",
  	"Saloon_Sat2": "Hey farmer! D'ya believe in love at first sight or should I walk in front of you again?$1#$b#Aw, lighten up, farmer. I'm just teasing ya a little. Beer on me?^Aw, lighten up, doll. I'm just teasing ya a little. Beer on me?$10",
  	"Saloon_Sat6": "My uncle absolutely sucks, he treats Henry like garbage and then expects him to be his personal slave forever.$5#$b#I really wish Henry learned to *not* act like his slave in the first place, poor guy thinks blood family is all there is to life.#$b#%Sterling grumbles as he downs a good portion of his beer.",
  	"Saloon_Sat8": "What's up, dollface? I'm just having some soda tonight, I know you and my family like me a lot better when I'm sober.",
  	"Saloon_Sun6": "You know, Henry and Mia say like it better when I don't drink.$5#$b#...$12#$b#But after a while you reach a point where you've drank enough and it's not really clear if the real me is the drunk ass and the sober me just a performance.$12",
  
//GENERIC DIALOGUE 

	"spring_Mon": "I'm not actually here for long.#$b#Mia and Henry are letting me stay with them while I figure myself out.#$b#Trying to turn a new leaf and all.$10",
	"spring_Mon2": "Is... Sebastian always that strange?$3#$b#I thought we could talk about our bikes but he side-eyed me and went back to work$3#$b#I guess not everyone is as friendly now as when I was a kiddo.$11",
	"spring_Mon4": "Does the country air feel weird to you sometimes?#$b#Like, after spending so long in the city. This is almost too clean...$0",
	"spring_Mon6": "Hey, angel, did it hurt when you fell from h-$1#$b#OW! Fine, I get it, I get it. That one was bad$10",
	"spring_Mon8": "Oh, hey @. This isn't really a good time...$8#$e#Hm? No, it's nothing you did.$7#$b#Just... Feeling wrong.#6",
	"spring_Mon10": "Ahh... Hey sugarcups.$2#$b#Sorry I'm not-Feeling great today-$12#$e#Just the shakes, didn't go away after the night-$12#$e#Sorry- I'll try to do better. Don't worry about me.$9", 
	"spring_Tue":  "Have you met Henry yet?#$b#We grew up together, currently live up the road with Mia if you ever wanna come say hi.$1#$b#They're pretty neat for letting me stay with them.",
	"spring_Tue2": "Pierre can be such a nag...$8#$b# Don't tell him I said that.$7",
	"spring_Tue4": "Don't tell Mia I told you... But she loves Poppies.#$b#You should try gifting her some, it'd absolutely make her day.",
	"spring_Tue6": "Morning, puppet. How's the farm life treating you?",	
	"spring_Tue8": "God I... Can't really sleep ever since I moved from the city.$8#$e#Shakes can't stop keeping me up at night.$6#$e#Sorry, @, I shouldn't be dumping this on you.$11",
	"spring_Tue10": "Even if you don't win Flower King, you're already a king in my eyes.$4^Even if you don't win Flower Queen, you're already a queen and more in my eyes.$4",
	"spring_Wed": "It's finally my day off.#$b# I can finally get those extra reps in. Can't just let Alex one up me.$10",
	"spring_Wed2":  "Hey, hotstuff. What are you doing all the way out here?#$b#Better have come here to see me.$1",
	"spring_Wed4":  "You're honestly the most exciting thing the valley's seen in a while. #$b# Almost like a celebrity. It's kind of surreal when you just talk to me like that.$h",
	"spring_Wed6":  "Did you know I grew up on a farm too?#$b#I'd be happy to give a hand any time if you ever need me.$h",   
	"spring_Wed8":  "I... Have to admit.#$b#I always look forwards to you seeking me out.#$b#I love my family but... Someone who has no obligation to enjoy you, liking you this much?$4#$b#Thanks for being so good to me, @. You make me want to be as good.$1",
	"spring_Wed10": "Hey lollipop. Have you been practicing your steps for the flower dance?$1#$e#Don't worry, if you fall, I promise I'll catch you.$10", 
	"spring_Thu": "So, do you follow any sort of workout for being a farmer?#$b#It's a rough job! I assume you work hard to keep in shape either way.#$e#You certainly make good show of it.$10",
	"spring_Thu2": "Have you tried giving Henry Blackberry Cobbler?#$b#He goes crazy for that stuff.$1",
	"spring_Thu4": "Hey farmer, are you taking care of yourself?#$b# Don't want to lose the valley's prettiest face that easy.$h",
	"spring_Thu6": "I've been trying to have some strong coffee in the morning to avoid alcohol.#$e#It's not going well, but maybe if it'll get better if I keep at it.$1",
	"spring_Thu8": "Damn, farmer. You can't just go around looking that good even after working all day.$1#$e#Really makes me want to borrow a kiss and never give it back.",
	"spring_Thu10": "Hey, are you busy today?#$b#How do you feel about just take the day off and roll around in the flower fields?#$e#Well, take that suggestion as you will.$10",
	"spring_Fri":  "Hey farmer, how are you enjoying life in the valley?#$b#Would you say your house feels like... A home, already?#$e#Hm, why? Oh, I- Never mind. Don't worry.$3",	
	"spring_Fri2": "Pierre just tried giving me some of his 'secret recipe' cranberry jelly without telling me what it was.$2#$b#I'm actually incredibly allergic to cranberries. Like, deadly so.$2#$e#I'll be delighted to try out anything anyone makes for me... Just not that.",
	"spring_Fri4": "Have you ever been out to Zuzu City?#$e# I left... A lot of things behind there, most I'm not proud of.$11#$e#I think about them from time to time, makes me grateful I'm here now. Met all of you.$0#$e#... You, most of all.",
	"spring_Fri6": "Hey what do you think about that merchant that comes around the forest? You buy from her often, don't you?$4#$b#I heard she brings smuggled goods and other... Exotic things. You wouldn't happen to know if she sells anything...#$b#*gulp*$12#$e#Nevermind, don't worry. Don't worry about it, @.",
	"spring_Fri10": "I was thinking of you this morning.$4#$b# I just wanted to say thank you... For reminding me what butterflies feel like. It's been so long.$4",
	"spring_Sat": "Oh hey farmer, what's up?#$b#Don't mind me, I'm kinda hungover...$6#$e#You should try hanging out at the Saloon on Fridays sometime. Most of the town hangs out there.$1#$b#I even get Henry to come with me sometime.$1",
	"spring_Sat2": "I'm surprised you don't mind hanging around me.#$e#Most people usually grow annoyed by now.$1#$e#Guess I'll be sure to tease you harder and see how you hold up. $9.",
	"spring_Sat4": "I got a text from one of my old friends today.#12#$e#I don't know if I can even call them friends anymore.$12#$b#They watched me waste way in a haze of substances and trouble and had me chug on them harder.$8#$e#Maybe it's best I block their number...",
	"spring_Sat6": "I'm actually growing a love for black coffee.#$b# Stopped drinking because it reminded me too much of my ex.#$e#Now I'm worried I might only be adding another addiction to the list instead of trading it for another...$3",
	"spring_Sat8": "Hey, handsome^Hey, gorgeous#$b#I saw this on my way to work today. It made me think of you.[595 18]$9",
	"spring_Sat10": "%Sterling seems rather out of it.",
	"spring_Sun": "Do you ever just lay down in your fields and look at the stars?#$b#If you haven't, I'd be happy to take you stargazing one of these days.$1",
	"spring_Sun2": "Oh hey, hotstuff. You on your way to the mine?#$b#You should take this, I found one the other day and they're strangely delicious.[225]$9#$e#What do you mean I shouldn't 'just eat strange stuff I find'?$11",
	"spring_Sun4": "Ugh... I shouldn't have drank that much yesterday.$6#$e#%Sterling doesn't seem able to talk much at the moment.",
	"spring_Sun6": "Did you ever travel much before moving to the valley?#$b#I've personally never been past Stardew and Zuzu City...#$e#Unless Grampleton counts! But that's right next door!$1",
	"spring_Sun8": "Sometimes I wonder if I clung to Shane because he reminds me of my friends back in the city...$11#$e#They weren't exactly great people.$2#$b#Neither was I, to be fair.$11",
	"spring_Sun10": "%Sterling seems like he's having a bad day, you realize it's most likely withdrawals.",
	"summer_Mon": "And suddenly, all the guys in the valley were shirtless.#$e#*Chuckle*$9",
	"summer_Mon2": "Do you still keep in contact with your friends from the city?$11#$b#I dunno, I haven't heard from mine in a long time. Kind of makes me wonder if they even notice I'm gone.$12#$e#Maybe I should message them first one of these days...$3",
	"summer_Mon4": "I really admire people like you, chasing after their dreams and with clear goals in mind.#$b#Me? I dunno man, trying not to screw myself from an overdose I guess.#$b#I've been cold turkey since I moved to the valley, so I guess I'm not doing too bad for myself in that regard.#$e#Alcohol poisoning's definitely gonna take me first at this rat.$10",
	"summer_Mon6": "Have you been drinking enough water? It's not just good for your hard labor days.#$b#It also works wonders for one's mental state.$h#$e#I definitely need to get on top of my intake some more...#3",
	"summer_Mon8": "I hear there's going to be a beautiful full moon tonight.#$b#Ever skinny dipped in the moonlight?$1#$e#Would you like to try?$10",
	"summer_Mon10": "Hey darling, parading your pretty face around town today?$10#$b#%Sterling leans in to steal a fleeting kiss from you.#$b#Just make sure you don't push yourself too hard, call me if you need any help with your work.$0",
	"summer_Tue": "I hope the farm takes off for you.#$b#It'd be a shame not seeing your pretty face around.$10",
	"summer_Tue2": "You really do forget about a lot of things after spending too long in the city, don't you, poppet?#$b#I'd totally forgotten how much I love trains. Henry and I loved played on the train tracks when we were children, I like heading there some nights still. Relive some memories.#$b#Shame Henry won't come with me.$9", 
	"summer_Tue4": "Ah, you know what? Screw my friends from the city. I'm just happy to have Shane around.#$b#And of course, you too, farmer.$10", 
	"summer_Tue6": "The air sure is nice in the valley, isn't?#$b#Almost like you can breathe it in and just... Be somebody else. Better.",
	"summer_Tue8": "Mia makes this crazy good banana pudding during the summer. You should swing by the house tonight so you can try it.$h#$b#Bring some of your fresh Jelly if you'd like, it's Mia's favorite.",
	"summer_Tue10": "Hey sugar plum!#$b#Cinnamon? Sugar? Bunny? Angel face?... Baby bear.$9#$b#You're too good, I just can't decide.$1#$e#... *quietly* buttercup, cherry pie, chunky monkey *chuckle*$4",
	"summer_Wed": "Man, I should probably drink more water...",
	"summer_Wed2": "Mmm... I love summer around the valley.#$b#Warm enough to wear light clothes, chilly enough during the evening for night walks.$h",
	"summer_Wed4": "Have you gotten to see the valley much, farmer?$h#$b#There's a lot more to the valley than just Pelican Town, sugarcakes.$10#$b#My bike needs to get some more action. Call me up any time and I'll be your personal tour guide.$10",
	"summer_Wed6": "Why am I always hitting on you?#$b#Well, I'll spare you asking if you're jealous since I'm feeling nice today$10#$b#But unfortunately, not everyone's even half as fun to harass as you. Sorry, sugar.$10", 
	"summer_Wed8": "%Sterling seems a bit preoccupied#$e#Oh, what's up, hotstuff?#$b#Yeah, don't stress too much about me, just contemplating difficult decisions...$11",
	"summer_Wed10": "You know, I've been adrift so long...#$b#It finally feels good to call something permanent, to call someone mine and be entirely sure of it.#$e#... Never had wanted marriage and children this much in my life...",
	"summer_Thu": "I don't envy the outdoorsy folk during the summer.#$b#If only Henry didn't have me giving him a hand on the farm on my days off...$8",
	"summer_Thu2": "I need like... Seven days off a week. Just Wednesdays and Fridays are barely enough.$6",
	"summer_Thu4": "Hey farmer! Make sure you're only buying from Pierre's okay?$10#$b#How else am I gonna get to see the valley's new prettiest face everyday otherwise?$10",
	"summer_Thu6": "Hm? Why do I always call you farmer?$7#$b#Oh, sorry. Would you rather I go back to hotstuff? Babycakes? Sugarplum?$10#$e#Sorry, @. The pet names just look great on ya.$10",
	"summer_Thu8": "Pierre invited me to dinner tonight with his family. He's never been this nice to me before.#$b#Feels... Good, to communicate, I'll admit. I might take this 'relying on others' thing to heart.$9",
	"summer_Thu10": "Man, having this much conviction about something? It feels good!$h#$b#It feels so, SO GOOD.$9#$e#I wish every day could feel like this. It sure would make getting sober so much easier.$0",
	"summer_Fri": "Thank god it's Friday. Mia, Henry and I like bundling up on the sofa and watching our favorite show. What do you do to relax, farmer?",
	"summer_Fri2": "Mia made some pancakes this morning, shaped them like bears and painted faces with the syrup.#$b#I used to make the same ones for my ex. It was a bit nostalgic.$s",
	"summer_Fri4": "How do you like spending your Friday afternoons, romeo?^How do you like spending your Friday afternoons, dollface?$10#$b#I'm a phone call away if you ever grow too bored.$10",
	"summer_Fri6": "%Seems rather distracted.#$e#Oh, hey sugarcups. Having a good day?#$e#I was thinking of having a beer but... I think its too nice a day for that.",
	"summer_Fri8": "%Sterling seems to be staring at you.#$e#... Oh, sorry farmer. I think there's something wrong with my eyes, I can't seem to be able to take them off of you.$10#$b#Hope you're holding up well, sugar cakes.$1",
	"summer_Fri10": "Oi! Where do you think you're going there, cutie? Stop there in the name of the Pelican Town PD.$1#$b#Now tell me you criminal. Have you eaten today? No? Then let's head home and make you Sterling's Spicy mash.$10#$b#Special from the house.$13",
	"summer_Sat": "...Oh god, the hang over...#6",
	"summer_Sat2": "Nothing like a good morning workout to get the blood flowing to all the right places.$1#$b#I'm sure you get plenty of 'em having to get up and farm so early on. Can't imagine how you're doing all that on your own.",
	"summer_Sat4": "I... might've had too much to drink yesterday.$6#$b#I'll probably end up washing this down with something stronger...",
	"summer_Sat6": "I spent this morning helping Mia weed the garden and then we had some pie for breakfast.#$b#Strange way to wake up on a Saturday, I'll admit. Would've woken up tossed about on some dumpster when I lived back in the city. Spent the rest of the day finding who to get high with next.#$e#Doesn't feel bad knowing we'll all just watch a movie tonight instead.$1#$b#You can join is if you'd like, farmer.$0",
	"summer_Sat8": "I love the sounds of cicadas during the night. It's like they're trying to tell us something in their symphony.#$e#They say I should steal a kiss from you. Don't worry, little do they know I don't do anything without permission.$10",
	"summer_Sat10": "I'm feeling like getting a bit wet today, aren't you?$6",
	"summer_Sun": "I might head to the beach later. The water's incredibly nice this time a year, and the view of the ocean is even better.",
	"summer_Sun2": "Man, Haley is kind of cute isn't she? Specially during the summer.#$b#What? No, I'm not into her. I've been around my fair share of girls like that when I was in the city. Good looks don't make up for unpleasant company.$10#$e#Though girls like that aren't usually so cold for no reason, don't really blame her.$1", 
	"summer_Sun4": "Hey sugarcups. How's the heat treating you?#$b#One of these days, you should let me take you down Ocean Drive. Nothing but beautiful coast for miles, the breeze, and the sound of seagulls.#$b#I've been in dire need of a good partner to take the drive down there to, hope you're up for it.#$e#They do say the best way to get to know someone is taking a good ol' roadtrip with them.$10",
	"summer_Sun6": "Is there an airport nearby, or was that just my heart taking off? You're really sporting the summer look, farmer.$10#$b#Save some of the good looks for the rest of us, sure Haley might appreciate that.$10",
	"summer_Sun8": "I might head to the beach later. The water's incredibly nice this time a year, and the view of the ocean is even better.#$e#That is of course, unless you join me. No view better than you all year-round.$10",
	"summer_Sun10": "Ah, hey there sunshine. I was planning on coming to help out at the farm shortly.#$b#Hope you didn't finish all work on your own, how am I supposed to impress you otherwise?$13",
	"fall_Mon": "Finally Pierre can't yell at me it's not almost Halloween!#$e# I'm gonna go snort some pumpkin spice and dance with a 10' foot skeleton, if you could excuse me.$10",
	"fall_Mon2": "Hey, farmer. You be careful about buying from Pierre's, alright?$5#$b#Old man likes buying your stuff and then claiming its all from his back garden, useless old man...$5#$e#...$7#$b#Well, yeah he's my boss; but he just called me useless first so I'm not about to hold my punches.$5",
	"fall_Mon4": "It's getting a little chilly lately, isn't it?#$b#Oh I'm fine, I mostly stay inside at Pierre's and back home. Please be sure to stay warm, farmer.",
	"fall_Mon6": "%Sterling seems to be pacing on his own in the distance. He looks agitated.#$e#%Getting closer, it's clear he's cursing under his breath. He appears a bit frantic.#$e#%Sterling sees you and quickly walks away without saying anything. Not very typical of him. You find he almost seemed jittery.",
	"fall_Mon8": "Pierre and I had a talk today while I was having my break. No insults or 'criticisms' this time around.$11#$b#He just kind of... Put his hand on my shoulder and said things would be alright. We'd make sure they stayed alright this time around.$0#$b#It was.... Welcome.$13#$b#I don't know why it feels so long since I felt that. From anyone other than you at least. Thanks for being there, farmer.$0", 
	"fall_Mon10": "Hey handsome, why don't we head home together and I can help ya sweep up those pesky leaves for you?^Hey dollface,why don't we head home together and I can help ya sweep up those pesky leaves for you?#$b#We can jump into the pile afterward.$10",
	"fall_Tue": "It's odd, I haven't used my old leather jacket in months.#$b# Takes me back to a different place in my life, but I'm a lot happier with who I am now.",
	"fall_Tue2": "I bet you must make the best leaf piles over at your farm.$1",
	"fall_Tue4": "I'd love to have a tour of your farm someday. Maybe I could take you out for a ride in exchange?#$b#Make a fun day out of it.",
	"fall_Tue6": "Nights are always beautiful during the fall, aren't they? There's always a certain charm to it.#$e#...Don't worry, I'm not gonna go playing in the tracks.$5",
	"fall_Tue8": "Things feel so very still during the fall, specially when it rains. Leaves you plenty of time to think.#$b#That's probably why I avoided the valley for so long. No quiet when your mind buzzes with alcohol and drugs.$12",
	"fall_Tue10": "Wait excuse me, is that the most beautiful person in the whole world who I'm seeing? My eyes must be deceiving me.$10#$b#Might you honor me with a kiss before you go on your way?$0",
	"fall_Wed": "Mmm. You smell real good, farmer. Is that cranberries I smell on you?$10#$b#%Sterling is taking a smell back.#$b#... It smells real nice! However I'm quite allergic, so I'd rather not die today.$3",
	"fall_Wed2": "I honestly don't miss the city. There's some things I'm happier having left behind.#$b#Hm? Oh, nothing important. Trouble mostly.#$b#I can still show you trouble if you ask, though.$10",
	"fall_Wed4": "Sorry farmer, I'm a little busy today. Dictionaries are such a drag to try and navigate, but I'm not about to let Aideen win with her big fancy words.$8#$e#...What's a cockalorum anyway...$5",
	"fall_Wed6": "Why am I always hitting on you?#$b#Well, I'll spare you asking if you're jealous since I'm feeling nice today$10#$b#But unfortunately, not everyone's even half as fun to harass as you. Sorry, sugar.$10",
	"fall_Wed8": "Oh hey there pretty face.#$b#Sorry, I'm having a bit of a... Rough day today.$2#$e#Oh no, just some emotional stuff. Not the shakes, don't worry. Though I fear those might come later...$3",
	"fall_Wed10": "You know, it's considerably nicer not having to fight with Mia almost every weekend.#$b#We just enjoy each other's company, like family. I guess taking sobriety seriously is not all bad,$9#$e#... Hopefully I can remember that next time I got the shakes.$3",
	"fall_Thu": "So you worked for Joja when you lived in the city? I can see why you were so desperate to drop everything.$1#$b#Me? I switched between bartending at nights and being a barista during the day at my best. But more often I couldn't really hold a job down.#$e#So I guess Pierre is not that big of a change, retail's not too different here or there.$3",
	"fall_Thu2": "It's... A rough day today$11.#$e#Sorry farmer, this shit is hard to talk about.$12",
	"fall_Thu4": "Farmer! You want to come play tug of war with Henry and I this weekend? You get to be on Mia's team if you show up.#$b#Mine if you so fancy, however.$10",
	"fall_Thu6": "I'll be having my lunch soon. Would you like to share?#$b#Mia sent me a bento lunch, shaped the rice like a little panda.#$b#I had never really had one of these before I moved over.#$e#Mostly pizza and ramen dinners when I lived back at home.$13",
	"fall_Thu8": "What's your favorite movie, angel?#$b#I bet it's something real corny.$10#$e#Mine?... I guess I really like Anastasia.$4#$b#HEY! Don't go giggling about it!$10",
	"fall_Thu10": "Stop there you criminal!$10#$b#Thinking you can just pass me up without sparing a poor man a kiss? Come here, numnum.",
	"fall_Fri": "Hey farmer! Keeping busy?$10#$b#Henry and I are heading to the bar later tonight, you should join us for a few rounds of pool. Drink's on me.",
	"fall_Fri2": "Are you feeling the spooky vibes in the air?$10#$b#That's sprit's eve fast approaching, baby.",
	"fall_Fri4": "It's finally the weekend. Shane and I have been looking forwards to getting super buzzed all week.$10#$e#What do you mean I drink almost every day? So what?$8",
	"fall_Fri6": "Oi farmer, wait up, you dropped this!#$b#Ah, perfect, I can now tell Henry I've been touched by an angel without being called a liar.$10",
	"fall_Fri8": "Pam invited me over for a few beers today. It was hard saying no.$12",
	"fall_Fri10": "Good thing I'm seeing you, love. Mia baked some wonderful cake this morning and made me swear I'd get your slice to you.#$b#Be sure to take it easy today, okay? I'll swing around to pet %pet later tonight.[220 221 234]",
	"fall_Sat": "Heard it's raining tonight farmer, make sure to bring an umbrella with you!",
	"fall_Sat2": "Hey farmer! I saw %pet wander inside Pierre's shop earlier in the morning. Gave them a few pets and sent them on their way home.$1#$b#I hope they made it safely. Absolutely adorable, I hope you knew that.",	
	"fall_Sat4": "I'm thinking about going for a ride later tonight, my poor bike barely gets some action anymore lately.#$e#Fancy getting out of town, farmer?$10",
	"fall_Sat6": "I had a weird dream where I went to work in nothing but my underwear, and I didn't notice until you walked in the door to Pierre's.$12#$e#Had to triple check I'd gone out of the house wearing pants after that. I hope you're having a better day.$3",
	"fall_Sat8": "Farmer! Are your pumpkins ready just yet? I'm gonna have to buy the three biggest ones as soon as they're for sale.$1#$b#Four if you come join us for carving them. Mia can stab one hell of a mean pikachu into them.",
	"fall_Sat10": "I see you're wearing my hoodie today.$10#$b#Soft isn't it? It's boyfriend material.#$b#What, you thought I'd stop with the pick up lines just because we're dating now?$13",
	"fall_Sun": "The valley is cool and all during the fall, but nothing compares to a good pumpkin spice latte from Zuzu City's Starbrooks.",
	"fall_Sun2": "It's important to take a day off, farmer. Henry, Mia and I like to watch a show together during Sunday evenings.#$b#Do you have any traditions?",
	"fall_Sun4": "Farmer, this is an urgent visit from the Fall department to make sure you're sufficiently in the spooky spirit.$11#$b#They have prepared these provisions to maximize your fall enjoyment.[236 608 260]$10",
	"fall_Sun6": "I was thinking I was only gonna eat a slice of pizza today but it's hard to turn a beer with Shane down... Amnotthat buzzzzed I swear. Sorry farmer.$4",
	"fall_Sun8": "Hey farmer! Are you a broom?$1#$b#Cus you're sweeping me off my feet here!$9#$e#Ow! Fine, okay, that one was terrible.$3",
	"fall_Sun10": "I'm so excited for Spirit's Eve, nothing like some cheap horror and my shmoopy pie's hand to make a man happy.$9#$e#What? I'm a man of simple tastes and terrible pet names is all.$1",
	"winter_Mon": "Now that the winter's began, you better make sure not to be a stranger, farmer.$10#$b#Pierre's about to get a hell of a lot more boring without you around.",
	"winter_Mon2": "Man! Shame about the winter, I'm going to miss seeing your pretty face around Pierre's.",
	"winter_Mon4": "If I could change one thing about the valley, it'd probably be the way it snows.#$b# It was always so cold in the city, and Stardew I've always related to warmth and the rolling fields.#$e#It's hard not getting sad when everything looks as white and bleak as it did in the city.",
	"winter_Mon6": "$y Now tell me, @. Are your parents bakers?_Yes, actually!_No wonder you're a cutie pie then!_Afraid not._Really? Because you're the biggest cutie pie I've ever seen.$10",
	"winter_Mon8": "Aren't you cold, @? Here, Mia sent me with something to warm you up with.[395 253 199]$1#$b#Make sure to take care of yourself, handsome^Make sure to take care of yourself, gorgeous",
	"winter_Mon10": "If we get more serious, I hope I can quit at Pierre's someday to come help you at the farm full time.#$b#I'd still need to help Henry and Mia on occasional Sundays, though.$9",
	"winter_Tue": "Sucks you can't grow much in winter.$2#$b# I'm going to miss seeing your face around.$2#e#Don't be a stranger, okay?$1",
	"winter_Tue2":  "I'm freezing, my butt off today. I guess that's what I guess for expecting the valley's winters to be any milder.$1#$b#I didn't exactly pack much when I left, only got a backpack's worth of clothes on me unfortunately.$2",
	"winter_Tue4": "Strange to see how religious the folk are at the valley. T'was a rare thing to see in the city.",
	"winter_Tue6": "Hey, handsome!^Hey gorgeous!#$b#Make sure to pet %pet lots for me today if you can. Been a while since I've seen you take them out for a walk. They're sorely missed!$1",
	"winter_Tue8": "It's... Weird to think you come to love a person so much, and one day they're your whole world; and the next one they're simply not...$12#$b#... There.$2#$b#Sorry, @, I shouldn't be talking like that. I just...#$b#Scares me sometimes, getting back into a relationship. Screwing it up, feeling like I need to run away so they'll be better off.$5#$e#You'd hit me if I ever tried that, right?$1",
	"winter_Tue10": "Hey are you too busy today?$4#$b#I was thinking we could just stay home and keep each other warm.$9#$e#Bundle up by the fire if you're  too cold otherwise.$9",
	"winter_Wed": "You know what really helps warm the soul up? Some good Gus apple cider.$1#$b#My pa would take me to drink some when I was a lad, had my first cup on a wintery afternoon like this.#$b#Man I'm getting sentimental just thinking about it...$4",
	"winter_Wed2": "I almost slipped on the ice today. I'm so not used to winter in the country side anymore.$6#$b#Back in the city snow melts so fast with how crowded the streets are, people stomp and clean through it faster than it can accumulate. You end up taking those things for granted.#$b#You be careful, farmer. Maybe a better pair of boots is due for me soon...",
	"winter_Wed4": "Don't worry about George not liking me too much. He knew me when I was a dumb kid kicking my ball over his fence.#$b#Before Alex moved in with him and all. He wasn't much happier back then either, despite what the old man says.$10#$e#He's a good guy regardless, you should get him some peppers sometime.",
	"winter_Wed6": "I have been rather distraught to find out you're not immediately falling for the whole rugged leather jacket type schtick.$10#$b#This is the most effort I've ever had to put in charming anyone I must admit. Should I try some other tired archetype for you, farmer?$10#$b#Maybe the good ol' country sweetheart. Well, I guess that's Henry's thing ain't it?$13#$e#You're special farmer, never change.$1",
	"winter_Wed8": "I swear snowflakes are so much clearer out here. They have beautiful shapes and sizes.#$e#Not unlike you, farmer.$1",
	"winter_Wed10": "Are your hands cold, darling?$1#$b#Come give them to me, I'll keep them warm while you run errands.$0",
	"winter_Thu": "I hear you spend most your winter deep inside the mines. That's... So crazy. Be sure to keep safe, I'd love to hear all your stories someday.",
	"winter_Thu2": "Sam, Sebastian and Abigail are a really good crowd. A bit too young and good to be around me though. Let them keep their innocence and wander while they got it.#$b#I hear their band is crazy good though. I honestly can't wait to hear them play.$1",
	"winter_Thu4": "Thursday is such a weird bastard day of the week, isn't it? Not quite midweek, the annoying bastion between Friday and you.#$b#Just... Good old Thursday.", 
	"winter_Thu6": 	"Some nights, Henry likes to pull out our old set of pokemon trading cards and we'll play a few games together.#$b#Are you a pokemon, farmer? Cus I'd definitely choose you.$10",
	"winter_Thu8": "It's good to look at my life and realize how many good people there are in it.#$b#Thank you for being one of them, @, it means the world to me.#$e#You mean the world to me.",
	"winter_Thu10": "Oh, your laces are undone, love. Allow me to tie those shoes, I don't want you falling for anyone else in my watch.$1#$e#There we go! All nice and double knotted for you.$9",	
	"winter_Fri": "It's freezing today, I really wish I didn't have to go outside.$3",
	"winter_Fri2": "... sorry farmer- hangover's bad--$6#$b#... talk to you... another time $6", 
	"winter_Fri4": "I can't wait for the river to freeze over enough to go ice skating.#$b#Would you consider going with me farmer?#$e#No drinking while on the ice I swear!$9",
	"winter_Fri6": "Today is certainly a snowman kind of day, do you care to join me, @?$1",
	"winter_Fri8": "Want a raisin? No? Well, how about a date? [398]$10",
	"winter_Fri10": "Hey, love. I saw this on my way to work, thought it was as pretty as you.[418]",
	"winter_Sat": "People here are crazy sweet. I didn't pack much so I needed a new sweater, and Emily immediately offered sewing me one.#$b#Said there was no need of going all the way to Grampleton. I'll have to think of ways of saying thank you... No one's really got anyone's back out in the city. It's a strange feeling.",
	"winter_Sat2": "The one good thing about winter is we don't seem to get a lot of tourists around. They can make for some really rude costumers.",
	"winter_Sat4": "The valley has really helped keeping me off my phone. The reception is so poor it really helps get you out of the habit.#$b#Also keeps me from checking up on my ex, or my city friends. Maybe I should try harder on that front...$12",
	"winter_Sat6": "No way to start your day but with some heavy caffeine and a few splashes of whiskey. Shane taught me that one.$10",
	"winter_Sat8": "Pam invited me over for a few beers today. It was hard saying no.$12",
	"winter_Sat10": "Darling, you and I are like nachos with jalapeños.#$b# I'm super cheesy, you're super hot, and we belong together.[215]$10",
	"winter_Sun": "I need like... Seven days off a week. Just Wednesdays and Fridays are barely enough.$6",
	"winter_Sun2": "Damn farmer! I hope you know CPR, because you are taking my breath away today!$10#$b#Are you sure you're not a parking ticket? Because even in winter you got fine written all over you.$1",
	"winter_Sun4": "Here farmer, Mia and I baked some Blueberry Tarts last night, it's my favorite.#$b#You should have some, let her know how you liked it. [234]",
	"winter_Sun6": "Some hot chocolate, farmer? Don't worry, this one's not spiked with anything. [395]",
	"winter_Sun8": "You must be exhausted, @ , because you've been running through my mind all day.#$e#Do be sure to be taking it easy.$9",
	"winter_Sun10":"I almost headed to the saloon tonight. I guess old habits do die hard.$12#$b#Why don't we go home and cuddle up by the fire? Watch the breakfast club.$1#$e#... Hold hands under the covers...#$b#%Sterling nuzzles against your ear gently.",

}
		},
			{
					"LogName": "Sterling Dialogue",
					"Action": "EditData",
					"Target": "Characters/Dialogue/Sterling",
					"Entries": 	{
							
						"spring_Wed":"Hey, farmer. I didn't work today, so Mia spent the morning teaching Henry and I how to make these.{{spacechase0.JsonAssets/ObjectId:Bear Pancakes}}#$b#Cute, aren't they?$1",
						"summer_Mon":"Oh hi, @! Be careful with the heat out there, I feel like I'm just about to melt.#$b#Mia sent me with some tasty lemonade to keep me hydrated though, here, I'll share.{{spacechase0.JsonAssets/ObjectId:Summer Pink Lemonade}}",
						"fall_Sun":"Hey, farmer. I didn't work today, so Mia spent the morning teaching Henry and I how to make these.{{spacechase0.JsonAssets/ObjectId:Bear Pancakes}}#$b#Cute, aren't they?$1",
						"winter_Thu":"Hey farmer, are you a cold? Cus I'd like to catch you sometime.$10#$b#Ya know, so that you don't fall and all?$1#$e#Here, this is for you.{{spacechase0.JsonAssets/ObjectId:Starshot Cappuccino}}"
								},

						"When": {"Hearts:Sterling": "5"}
			},	
			{
				"LogName": "Sterling Marriage Edits",
				"Action": "EditData",
				"Target": "Characters/Dialogue/Sterling",
				"Entries": 	{
						
					"SeedShop_Entry": "{{Random:Missed me old man?++What's up, Pierre!++Good to see you Pierre!++Cry no more, Pierre. I'm here!|inputSeparator=++}}",

								},

					"When": {"Relationship:Sterling": "Married"}
		},
		{
			"LogName": "Sterling Marriage Edits",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Sterling",
			"Entries": 	{
					
					"Saloon": "{{Random:Hey, hotstuff$1#$b#Oof, one second. I need to breathe.$3#$b#Being with you just takes my breath away.$10++Don't sweat it, darling. I'm just having a soda.#$b#Who would've thought grapefruit! Of all things! Grapefruit soda could be so good?$1++Tonight I'm having a ginger ale. Gus said he got it shipped in for me to try it!$1++Hey lover, just spending the while before heading home.#$b#Would you like some of my soda?++Oh my, you are hotter than a sunburn!$10#$b#Are you related to the sun?...Because running into you just brightened up my day!$10++In your own honest opinion, how does it feel to look so great?++Hey farmer! Are you up for a game of pool? I'm out of my usual partners.++It's actually nice spending a little less time in here. Turns out it frees up a LOT of my day!++Hey lover, Know what's on the menu? Me 'n' u.$10++Orange soda has not tasted THIS good in years. This is a crime.$1++Trying out some of Shane's fizzy water tonight. Positively disgusting.$10#$b#I'll take death by sugar overdose instead, thank you.|inputSeparator=++}}",
					"Saloon4": null,
					"Saloon6": null,
					"Saloon_Fri": null,
					"Saloon_Fri4": null,
					"Saloon_Fri6": null,
					"Saloon_Fri8": null,
					"Saloon_Sat2": null,
					"Saloon_Sat6": null,
					"Saloon_Sat8": null,
					"Saloon_Sun6": null
				

							},

				"When": {"HasSeenEvent |contains= 40180011": true,},
	},
	{
    "LogName": "Pierre ARV Dialogue",
    "Action": "EditData",
    "Target": "Characters/Dialogue/Pierre",
    "Entries": 	
			{
				"Fri_inlaw_Sterling":"Tch. It's difficult trying to run the shop on my own after getting used to having someone to help me... As lousy as he might've been.$a#$b#.... I guess I miss him a little.",
				"Tue6_inlaw_Sterling":"Hi @. How's that husband of yours doing?#$b#Tell him to come pick up a shift or two one of these days if he's getting too much in your hair.",
				"Thu4_inlaw_Sterling": "Are you buying something today, @? I got a special offer in store, check it out!#$b#And say hello to Sterling when you get home from me. It's strange not having him around."
			}
	}
	]
}