{
"Changes": [
	
//------------------------
// FESTIVAL DIALOGUE   
//------------------------

	//Egg Festival----------------------
	
		{
			"LogName": "EggFestival",
			"Action": "EditData",
			"Target": "Data/Festivals/spring13",
			"Entries": {
			
				"Sterling": "Oh man, I remember when Henry and I used to participate in the Egg Hunt when we were rascals.$9#$b#It's a shame Lewis won't let us participate anymore.$h#$e#... *grumble* Still lets Abigail for some reason....$5",
        		"Sterling_y2": "You better be kicking Abigail's ass this year, farmer. I'm counting on you.$10#$3#Why?$7#$b#No reason in particular...$3",
        		"Mia": "Honestly I just like what a good excuse to dress up the egg festival is.$1#$b#I love the countryside, but I do find myself missing a lot of my wardrobe.",
				"Henry": "Sterling really seems hung up on not being able to participate in the egg hunt for some reason.$2#$b#I know it was fun but...we were kids back then. Things change.$2#$b#I hope he can see that someday.",
				"Henry_y2":"...Ok so I've been talking to Sterling.$9#$b#And I think he's right. We should be allowed to participate in the festival as well.$9#$b#Why not relax and relive some of our childhood joys, right?#$b#But since we can't we're counting on you to win in our stead. Don't let us down, @.$1"
			}
		},
				//Sterling Married 
					{
						"LogName": "EggFestival",
						"Action": "EditData",
						"Target": "Data/Festivals/spring13",
						"Entries": {
						
							"Sterling_y2": "{{Random: Have I ever told you you look particularity ravishing when you beat Abigail at the egg hunt?$10 ++ Go on, love. You must continue the glory of our family name by winning the hunt, so that I may recount your wins to all of our generations to come.$10#$e#I save all the extra hats for our children!$9 ++ It's always good to see Henry and Mia during the holidays. Even if Henry is struggling to relax as per usual.$9#$b#At least gorging ourselves of devilled eggs seems to lighten his mood. Maybe we should have them over for dinner some time soon. ++ Hey darling. What do you a mischievous egg?$10#$b#A practical yolker!$9 |inputSeparator=++}}",
							"Mia_y2": "{{Random: It's so strange not having Sterling to grumble about the egg hunt the night before. I hope he's not talking your ear off, @.$5 ++ Honestly I just like what a good excuse to dress up the egg festival is.$1#$b#I love the countryside, but I do find myself missing a lot of my wardrobe. ++ Henry and I spent the evening making some devilled eggs with his grandpa's secret sauce. That thing has a KICK to it!$1|inputSeparator=++}}",
							"Henry_y2":"Sterling seems pretty confident that you’ll be winning the egg hunt this year. Do you guys have some sort of secret plan?$8#$b#Actually, forget I asked. I don’t want to know what sort of schemes that man has in store.$6"
						},
						"When":
							{ "Relationship:Sterling": "Married"}
					},
		
	//Flowerdance----------------------
	
		//Flower Dance Accept
		
		{
			"LogName": "Marriage Flower Dance Accept Sterling",
			"Action": "EditData",
			"Target": "Strings/Events",
			"Entries": {
				"SpouseFlowerDanceAccept_Sterling": "Darling I have been waiting all year to hear you say those words. After you, sunshine.",
			}
		},

		//Dialogue 
		{
			"LogName": "FlowerDance",
			"Action": "EditData",
			"Target": "Data/Festivals/spring24",
			"Entries": {
			
        		"Sterling": "When I was growing up, this was actually called 'The Corn Dance'.#$b#Girls wore jewelry made out of corn kernels and danced around a specially grown giant corn crop while singing ritualistic chants.$h#$b#I can see why they'd change it.#$e#Just pulling your leg, farmer.$10",
        		"Sterling_y2":"What's up handsome?$10^What's up, gorgeous?$10#$b#Hope you've been polishing up your steps this year. Wouldn't wanna step on any toes this time around.#$b#Even if you don't ask me to dance at the event, you better end up saving me a dance for later.$10",
				"Mia": "It's a shame it's only Haley who gets picked every year, I would've loved to participate.$4#$b#Oh, it just reminds me of proms and dances growing up. I always dreamed of becoming Queen and dancing the night away.$1",
				"Mia_y2": "I'm feeling incredibly proud of the set-up this year. I helped the committee grow the flowers, and we ended up with some gorgeous results!$1#$b#Please don't mind me, I need to gush over the colour of the tulips this year. The breakthroughs are so exciting!$1",
				"Henry": "I'm really not sure why I came to this thing. I'm no good at dancing.$3#$b#But I suppose it's a nice enough day...And the company is a nice break from it all.#$b#Just don't expect to see me on the dance floor.",
				"Henry_y2": "Every year I come here saying I'll never dance, but then I see people like you and Sterling having so much fun.#$b#I may not be the best dancer, but I guess it doesn't hurt to get out there and shake a leg, right?$1#$b#Just...promise you won't laugh.$4"
			},
		},
				//Sterling Married
				{
					"LogName": "FlowerDance",
					"Action": "EditData",
					"Target": "Data/Festivals/spring24",
					"Entries": {
					
						"Sterling_y2":"{{Random: Well if it isn't the most beautiful person in the room coming to talk with me. I hope someone is ready come dance their feet off. ++ There he is! The only Flower King in my heart.$1$^There she is! The only Flower Queen in my heart.$1#$b#It's so good to get dressed up and spend the while with you, you look simply stunning.$0 ++ Mia's all proud of growing the flowers for the festival alongside Aideen, but what she doesn't know, is that the prettiest flower here she didn't grow.#$b#That's you, darling.$10#$b#%Sterling leans in to kiss you.|inputSeparator=++}}",
						"Henry_y2":"{{Random:Every year I come here saying I'll never dance, but then I see people like you and Sterling having so much fun.#$b#I may not be the best dancer, but I guess it doesn't hurt to get out there and shake a leg, right?$1#$b#Just...promise you won't laugh.$4 ++ Do I look ok in this? I always feel kind of funny dressing up for these big fancy festivals.$4#$b#Mia helped me put this whole thing together. I really don’t know what I would do without her.#$b#...M-maybe I should ask her to dance. Do you think she’d say yes?$4 |inputSeparator=++}}"
					},
					"When":
							{ "Relationship:Sterling": "Married"}
					
				},
		
	//Luau----------------------
	
		{
			"LogName": "Luau",
			"Action": "EditData",
			"Target": "Data/Festivals/summer11",
			"Entries": {
			
        		"Sterling": "Hey farmer! Have you tried the water? It's so good this time a year!$15#$b#You should come race Henry and I.$17",
        		"Sterling_y2":"%Sterling wolf whistles at you from across the beach.#$e#Looking good, hot stuff!$17",
				"Mia": "I never knew how much I loved dipping my toes in the water and enjoying the sun during the summer. And to be surrounded by everyone?$1#$b#It's just such a treat.$3#$e#Don't be forgetting to put on sunscreen, @!",
				"Mia_y2": "I originally only had plans to sunbathe and eat but racing the boys is sounding *incredibly* tempting right about now.$1#$b#Wipe that big arrogant smile off their faces, $5",
				"Henry" : "I've never been to an event like this before. It's definitely not what I expected.#$b#The food is delicious, but I'm really excited to see what everyone brings for the soup.$1#$b#I put in some of my grandpa's secret sauce. Should give the whole thing a nice kick.$1",
				"Henry_y2": "{{Random: This is definitely my favorite Pelican Town tradition these days.#$b#It's always nice to see everyone coming together to make something we can all enjoy.$1#$b#And don't worry, I didn't forget Grandpa Max's sauce.$10 ++ Sterling keeps trying to goad me into a race. Someday he'll have to learn to be patient.$3#$b#How irresponsible of me would it be to even consider swimming after eating? I have to wait at least thirty minutes.$9 |inputSeparator=++}}"
			},
		},
				{
				"LogName": "Luau",
					"Action": "EditData",
					"Target": "Data/Festivals/summer11",
					"Entries": {
						
							"Sterling_y2": "{{Random:I am positively starving to try the food after seeing what you brought. People are just going to love it.$14#$b#How did I luck out to marry the best producer of goods in the valley?$17 ++ Hey love! Wanna help me convince Henry to come race me? We don't get as many chances now I can't harass him on the daily.$15#$b#Or you can come race me instead, unless you're scared I'll beat your butt into the sand.$17 ++ I'm thinking we could go hit the dance floor after the ceremony, dance the rest of the evening away.$14#$b#Or now if you don't mind me soaking your nice clothes.$15|inputSeparator=++}}",
							"Henry_y2":"{{Random:I was tempted to bring my fishing rod today. Thought it might be fun to catch something fresh to add to the pot.#$b#But I figured this was time better spent with my friends. I can do plenty of fishing on my own time.#$b#Besides, this is a pretty noisy bunch. They’d probably scare all the fish away.$1 |inputSeparator=++}}"
				},
					"When":
					{ "Relationship:Sterling": "Married"}

			},
	//Jellies----------------------
	
		{
			"LogName": "Jellies",
			"Action": "EditData",
			"Target": "Data/Festivals/summer28",
			"Entries": {

				"Sterling": "Always a little sad when summer' over, isn't it?#$b#I much prefer the warm weather, the city is always so cold. It's a good reminder I'm home.",
				"Mia": "Before I went into agronomy, I was thinking about going into Marine Biology.#$b#I would've adored to write a paper on the endemic jellyfish life of Stardew Valley. Would've made for a really good thesis.#$e#... I suppose I can just enjoy the actual show for now instead.$3",
				"Mia_y2": "{{Random: Coming together with the rest of the town, seeing the jellyfish come and go while paying no mind to the rest of us...#$b#It puts me in a certain kind of mood. I can't describe it.#$e#....#$b#As if, I am really home here. ++ Hey farmer, did you know jellyfish have no brain, heart, bones or eyes. They are made up of a smooth, bag-like body.#$b#Kinda freaky, right? Specially when you consider some these brainless, thought-free creatures are immortal.#$e#Yoba acts in really weird ways sometimes. |inputSeparator=++}}",
				"Henry": "I've never seen anything like this before. It's such a beautiful reminder that nature is amazing in so many ways.#$b#Just when you think you understand it, you find something new to take your breath away.$1",
				"Henry_y2": "Do you ever wonder what it would be like to live like these jellyfish? Migrating from place to place as the seasons change?#$b#It seems like the ideal life, never having to cope with harsh conditions or anything of the sort.#$b#Maybe someday we'll be able to enjoy that some sort of freedom.$1"
			}
		},
				{
					"LogName": "Jellies",
					"Action": "EditData",
					"Target": "Data/Festivals/summer28",
					"Entries": {

						"Sterling_y2": "{{Random: Every year we all come together. Every year Eloise talks our ear off with jellyfish facts, everyone gathers around and every year the jellyfish migrate.#$b#There's a certain beauty in the certainty of that.#$b#I really never thought I'd be the one to say that.$9 ++ Hey dear, are you coming to watch the migration with us?#$b#Of course you can come hole up with us! We're al family after all.$1#$e#Nothing like avoiding crowds as a family. ++ I'm REALLY feeling a quick dip right about now, it's a shame about all the jellyfish.$1#$b#What? I know we came here to see them! It just feels like it could be so very refreshing.$0 |inputSeparator=++}}",
						"Henry_y2":"{{Random: Do you ever wonder what it would be like to live like these jellyfish? Migrating from place to place as the seasons change?#$b#It seems like the ideal life, never having to cope with harsh conditions or anything of the sort.#$b#Maybe someday we'll be able to enjoy that some sort of freedom.$1 ++ I remember a while back, Sterling was talking about trying to go swimming with the jellyfish.#$b#I managed to tell him why it was a bad idea and talk him out of it, but maybe you should give him a little reminder? ++ `Hey @, do you know if the festival’s going to be over soon?#$b#It’s always fun, but Mia and I are going fishing after. Going to give her a few pointers about night fishing.$1#$b#She’s not the best at it, but she’s still my favorite fishing partner. She always does her best.$10 |inputSeparator=++}}",
						"Mia_y2": "{{Random: Oh thank god you're here! If I have to spend one more minute trying to keep your husband out of the water, I'll just about go insane.$5#$b#You better stay to watch the show with us after though.$0#$e#You are much better company than Sterling.$5 ++ Do you ever think about all the different events and reasons that brought us all here, together, to watch this?#$b#I for one I'm happy it happened. Seeing you and Sterling together, getting to move Henry out of that horrible house of his... Every single decision like a light floating in the ocean. And yet they all move so cohesively together. Meant to be. ++ Coming together with the rest of the town, seeing the jellyfish come and go while paying no mind to the rest of us...#$b#It puts me in a certain kind of mood. I can't describe it.#$e#....#$b#As if, I am really home here. |inputSeparator=++}}"
				},
					"When":
					{ "Relationship:Sterling": "Married"}
				},


	//SVFair----------------------
	
		{
			"LogName": "SVFair",
			"Action": "EditData",
			"Target": "Data/Festivals/fall16",
			"Entries": {
			
      			"Sterling": "Henry thinks he needs to babysit me or I'm going to go off and gamble all my money at the wheel.$10#$e#*scoff*",
      			"Sterling_y2":"{{Random: Henry thinks he needs to babysit me or I'm going to go off and gamble all my money at the wheel.$10#$e#*scoff* ++ I tried my hand at the strength test and got a few tokens. Take that, strong man.$10|inputSeparator=++}}",
				"Mia": "{{Random: Have you gotten to the see the piggies yet, @?$1 ++ My favorite part of the fair is getting to enjoy all the leftovers.#$b#Clean up is boring, but that makes it all worth it.$1 |inputSeparator=++}}",
				"Henry": "Goodness. There's so many activities here...I don't even know where to start.#$b#Mia seems to think I would do well on the strength test, but...I don't know.$4",
				"Henry_y2": "Alright, this year I'm going to play it smart.#$b#Not only did I make a schedule for myself to ensure I get to participate in all the activities, I even gave myself a budget.$1#$b#...Or maybe I'll just spend it all on the fishing game.$8"
			}
		},
				{
					"LogName": "SVFair",
					"Action": "EditData",
					"Target": "Data/Festivals/fall16",
					"Entries": {
					
						"Sterling_y2":"{{Random: Henry thinks he needs to babysit me or I'm going to go off and gamble all my money at the wheel.$10#$e#*scoff* ++ I tried my hand at the strength test and got a few tokens. Take that, strong man.$10 ++ Hey darling! I left all the produce we agreed on besides the grange so you can arrange it as you want. You've always been the better one at arranging things. They're also your products after all.#$b#There's no way we're not winning this year with all the stuff you've grown.$1 ++ Do we need to ruin Pierre's grange this year, love? Just say the word, I'll make it look like an accident.$10|inputSeparator=++}}",
						"Henry_y2":"{{Random: Alright, this year I'm going to play it smart.#$b#Not only did I make a schedule for myself to ensure I get to participate in all the activities, I even gave myself a budget.$1#$b#...Or maybe I'll just spend it all on the fishing game.$8 ++ Hey @. You’re keeping an eye on Sterling, right?$9#$b#I know he’s been doing a lot better since you came along, but you can’t be too careful. Gambling can be a real temptation.$9#$b#Well...I’m sure it’ll be fine either way. I should probably have more faith in the guy.|inputSeparator=++}}",
						"Mia_y2":"{{Random: Have you gotten to the see the piggies yet, @?$1 ++ My favorite part of the fair is getting to enjoy all the leftovers.#$b#Clean up is boring, but that makes it all worth it.$1 ++ Henry and I are still preparing for our own grange display in Grampleton, can't really decide what we'll do just yet. But he said we could use the melons I've been growing!#$b#It's also been nice spending all the time together lately.$4|inputSeparator=++}}"
					},
					"When":
					{ "Relationship:Sterling": "Married"}
				},
		
	//IceFest----------------------
	
		{
			"LogName": "IceFest",
			"Action": "EditData",
			"Target": "Data/Festivals/winter8",
			"Entries": {
			
      			"Sterling": "%Sterling seems to be breathing heavily.#$b#Henry won the last snowball fight, but I'll get that man to eat snow if it's the last thing I do.$h#$e#%He seems a bit to worn out to keep talking.",
				"Henry": "It may be cold outside, but the fish are still biting.$1#$b#I won't be entering the contest or anything though. I'm just happy to get a chance to do a little fishing.$1#$b#The season's already been off to a rough start, so this is a much needed change of pace.$6",
				"Henry_y2": "Hey there @. Catch any winners this year? So far I've caught nothing but a couple of small perches.#$b#Not that I'm complaining. Fishing is never about the catch, it's about the act itself.$1#$b#I can't think of a more relaxing way to spend a winter's day than fishing with my friends.$10",
				"Mia": "Have you seen this adorable work of art? Isn't he the prettiest? Isn't he?$1",
				"Mia_y2": "The boys are super lame and tease me every year for how much I look forwards to spending time with the piggy."

			}
		},
				{
					"LogName": "IceFest",
					"Action": "EditData",
					"Target": "Data/Festivals/winter8",
					"Entries": {
					
						"Sterling_y2": "{{Random: Shame they don't let us keep the fish, some fish and chips for dinner sounds extremely tasty.$1 ++ %Sterling seems to be breathing heavily.#$b#Henry won the last snowball fight, but I'll get that man to eat snow if it's the last thing I do.$h#$e#%He seems a bit to worn out to keep talking. ++ Hey darling! You want to team up? We'll do you and me versus Henry and Mia, wipe those smug grins off their faces once in for all!$1#$b#Our team being the superior one simply by the virtue of having the hottest person from the group.$10#$b# What? I meant you!$9|inputSeparator=++}} ",
						"Mia_y2": "{{Random: The boys are super lame and tease me every year for how much I look forwards to spending time with the piggy. ++  Could you do me a favor and snow Sterling in the face? It would make me feel much better.$3 ++ Hey @! Excited to give Henry a run for his money to win that mariner hat? |inputSeparator=++}}",
						"Henry_y2": "Mia sure does like that little pig, doesn’t she? She gets so excited over the silliest things.$9#$b#It’s sweet though. I wish the simple things could make me that happy.#$b#Not that I’m complaining or anything. It’s just something I’ve always really admired about her. It’s nice to see her smiling.$4"

					},
						"When":
						{ "Relationship:Sterling": "Married"}
				},
		
	//WinterStar----------------------
	
		{
			"LogName": "WinterStar",
			"Action": "EditData",
			"Target": "Data/Festivals/winter25",
			"Entries": {
			
      			"Sterling": "Well, at least this beats spending Winter Star all alone in the city.#$e#Can't remember the last one it wasn't just me, the windowsill birds and an empty box of pizza.",
      			"Sterling_y2":"What I'm thankful for...?#$b#My family, this town.#$b#Their infinite patience.$4#$b#Putting up with my dumb ass when I fuck up, having always had my back, the helping hand everyone's been extending to me, the chance at a new life.#$e#Man, you'd think they would've thrown the whole man away at this point.$10",
				"Mia": "It's still odd spending Winter Star without my dad.#$b#He works a lot though, so I make sure to write him and send him plenty of pictures so he knows I'm thinking of him.",
				"Henry": "These events are always so awkward when you don't really know anybody.$9#$b#I just hope they like what I got them. I wasn't able to buy anything, so I had to make it myself.$3#$b#You can never have too many ornaments on the tree, right?$6",
				"Henry_y2": "It's always nice to see everyone so happy as we near the end of winter.#$b#It's the toughest season of the year but here we are, giving gifts despite all that.$1#$b#It's really sweet when you think about it. But I guess that's just the holiday spirit.$10"
			
			},
		},
				{
					"LogName": "WinterStar",
					"Action": "EditData",
					"Target": "Data/Festivals/winter25",
					"Entries": {
					
						"Sterling_y2":"{{Random:I swear every year my list of things I thank for gets so much longer.$1#$b#But you head all of them, darling.#$b#You, our home, our work... Any future children.$4#$e#And what's more, every year I thank you didn't just throw the whole man away.$10 ++ Happy Winter Star, darling. I don't know what you do but you somehow manage to out-do yourself every year.#$b#I was just telling Henry about our dinner plans for tonight, how does some duck sound?$1#$b#Don't worry, Henry is supplying it.$10 ++ Mmmm, well if it isn't my favorite gift? You're looking most tasty, my dear.$10#$b#I mean gorgeous! Gorgeous!$9 |inputSeparator=++}}",
						"Henry_y2": "{{Random: So...I may have gotten an extra present for Mia this year.#$b#We’ve been spending a lot of time together since you and Sterling got married and...it’s been really nice.#$b#I just wanted to show my appreciation for everything. Just don’t tell anyone, alright? I don’t want to get in trouble for breaking tradition or anything.$4 ++ It's always nice to see everyone so happy as we near the end of winter.#$b#It's the toughest season of the year but here we are, giving gifts despite all that.$1#$b#It's really sweet when you think about it. But I guess that's just the holiday spirit.$10 ++ I’ve been meaning to say this for a while now, but...#$b#Seeing you and Sterling so happy together always brings a smile to my face. It’s a nice reminder that two people really can find love together.#$b#I know it’s kind of cheesy, but I’m really glad you two found each other. And that you’re a part of our family now.$10#$b#Let me know if you ever need anything, @. Always happy to help. $10 |inputSeparator=++}}",
						"Mia_y2": "{{Random:I still miss my dad greatly, but there's nothing greater than having Winter Star dinner all together as a family.#$b#I packed something very special for you and Sterling, I can't wait for you to see it. ++ @ ! Happy Winter Star! For both you and Sterling. Are we still on for dinner tonight?#$e#I brought my special eggnogg for breakfast tomorrow morning. ++ Henry and I curled up besides the fire last night, it almost made us late for the feast today.$3#$b#Had to help him do his hair as per usual.$0|inputSeparator=++}}",
					
					},
						"When":
							{ "Relationship:Sterling": "Married"}
				},

	//RSV Ember of Resolutions----------------------
	
	{
		"LogName": "RSV Ember of Resolutions Dialogue",
		"Action": "EditData",
		"Target": "Data/Festivals/winter28",
		"Entries": {
		
			"Sterling": "One of my favorite parts about being back in the valley has to be the sheer amount of festivals.$10s#$b#There's a celebration for just about anything!$1#$b#And where there's celebration, there's free food too.$10",
			"Sterling_y2": "Man! Pika's food is an absolute banger.$10#$b#My resolution for next year is more of Pika's food, please.$9",
			"Mia": "Happy New Year, @! I wish you to have much success in your farm during the coming years.#$b#It's a pleasure sharing a community with you, I can only hope we can share it for many more years to move",
			"Mia_y2": "{{Random: I brought some blankets for me and the boys this year, be sure to come share with us if you get cold okay?#$b#The stars are so clear out here, it's such a warm experience to stargaze by the fire...++Happy new year, @! I hope this year brings you many, many blessings.$1#$b#Me? I'm just hoping for another good year here and for my dad to be doing okay... I wish I could convince him to come out here for this sort of occasion.$4|inputSeparator=++}}",
			"Henry": "I really shouldn't be here right now. There's so much work to be done to prepare for spring...$3#$b#But Mia and Sterling are a convincing duo. Even I have a hard time telling them no sometimes.$6",
            "Henry_y2":"A new year is just over the horizon. The thought of that used to always be exhausting just to think about. But now?#$b#It's actually kind of exciting. There's a lot to look forward to these days. Hopefully the next year will be as good as this one.$10"
		},
		"When":
		{ "HasMod":"Rafseazz.RSVCP"}
	},
			//Sterling Married 
				{
					"LogName": "RSV Ember of Resolutions Dialogue Married Sterling",
					"Action": "EditData",
					"Target": "Data/Festivals/winter28",
					"Entries": {
					
						"Sterling_y2": "{{Random: Man! Pika's food is an absolute banger.$10#$b#My resolution for next year is more of Pika's food, please.$9#$b#And yet somehow it's still not as good as yours, love.$10++Mmm... This year I'm wishing to have you for many, many long years.$4++... And maybe for a few little ones too.$10|inputSeparator=++}}",
						"Mia_y2": "{{Random: I brought some blankets for me and the boys this year, be sure to come share with us if you get cold okay?#$b#The stars are so clear out here, it's such a warm experience to stargaze by the fire...++My wish this year? I want to be an auntie by next year, @.$5#$b#All these kids I babysit and somehow no nieces or nephews. You can't possibly expect me to have that, can you?$5|inputSeparator=++}}",
						"Henry_y2": "{{Random: Hey there, farmer. I was wondering when you would show up.$1 You should probably go check on your husband before too long. The way he's eyeing Pika's food makes me worry he'll eat himself into a coma if you don't stop him.++You know, they say it's good luck to enter the new year with the people you love.#$b#Guess that means you're gonna have a pretty good year, farmer.#$b#Me? Oh...Well, I've got Mia with me so...Yeah. I think I'll be ok too.$4|inputSeparator=++}}"
					},
					"When":
						{ "Relationship:Sterling": "Married",
						  "HasMod":"Rafseazz.RSVCP"}
				},

	//RSV Gathering Festival----------------------
	
	{
		"LogName": "RSV Gathering Festival Dialogue",
		"Action": "EditData",
		"Target": "Data/Festivals/fall20",
		"Entries": {
		
			"Sterling": "Ey farmer! Buy anything cute?#$b#Yeah? Mia's not bought all the stalls out already?$10",
			"Sterling_y2": "{{Random: Ey farmer! Buy anything cute?#$b#Yeah? Mia's not bought all the stalls out already?$10++Did you know people in Ridgeside compete to sell the most goods every year?#$b#Oh don't worry, I'm above all that petty competition.#$b#... I bought a bunch of shit from the guys. Girls have it too easy with their charms.$10++Oh hey farmer! Henry and I were just talking about what we'll have for lunch.#$b#Pika's of course!$1|inputSeparator=++}}",
			"Mia": "Do you think it would be weird if I handed out some of my cards here?#$b#There's just so many farmers and I love working around the valley too much.$1#$b#So much better than the city.$3",
			"Mia_y2": "The boys are so annoying, they think they have to keep me at bay or I'll go crazy buying stuff.$5#$b#...$2#$b#... Do you think you could distract them though? There's still a few things I just HAVE to get and the boys are not going to let me.$4",
			"Henry": "This is an...interesting sort of event. Not really sure it's my style, but someone has to keep Sterling and Mia from going crazy.$6#$b#The concert should be nice, though. Seems like a good way to end the night. I just hope they don't play anything too wild.",
            "Henry_y2":"As nice as it is to see Mia getting excited, I wish she would be a bit more responsible with her spending.$6#$b#I don't even know where she plans to put all of this stuff she wants to buy. But I'm not sure she's thinking that far ahead.$6"
		},
		"When":
		{ "HasMod":"Rafseazz.RSVCP"}
	},
			//Sterling Married 
				{
					"LogName": "RSV Gathering Festival Dialogue Sterling Married",
					"Action": "EditData",
					"Target": "Data/Festivals/fall20",
					"Entries": {
					
						"Sterling_y2": "{{Random:Ey, love! Buy anything cute?#$b#Yeah? Mia's not bought all the stalls out already?$10++All these people competing for who has the best produce in the valley without knowing the top producer is standing right in front of my eyes.$10#$b#And kissing me.$10#$b#%Sterling steals a kiss from you.++Are you excited for the band playing later tonight? I'll save us seats, darling.|inputSeparator=++}}",
						"Mia_y2": "{{Random:Do you think it would be weird if I handed out some of my cards here?#$b#There's just so many farmers and I love working around the valley too much.$1#$b#So much better than the city.$3++Henry and I were seeing about maybe selling his farm's produce here, but he says it might be too hard convincing his father.$7|inputSeparator=++}}",
						"Henry_y2": "{{Random: Have you and Sterling ever considered opening up a stall yourselves one of these years?#$b#Between your products and Sterling's smooth talking, I'm pretty sure guys would outsell anyone else.$3++I swear, every time I turn my back for one second Mia's got another bag for me to carry.$3#$b#I want to get after her for it, but when I see that big smile of hers and she starts talking about how much she loves her newest purchase...It's really hard to stay mad.$6|inputSeparator=++}}"
					},
					"When":
						{ "Relationship:Sterling": "Married",
						  "HasMod":"Rafseazz.RSVCP"}
				},
]
}