{
  "Changes": 
    [
      {
    "LogName": "Sterling Strings",
    "Action": "EditData",
    "Target": "Strings/schedules/Sterling",
    "Entries": 
          {
        //Spirit's Eve Bodyguarding
         "halloween.000": "Sorry farmer! But the Inn's being prepared for tonight's party. Can't let ya enter until 1pm.$10",
        //Random Spirit's Eve Dialogue
         "halloween.001": "{{Random: Unfortunately the main celebration's a bit too crowded for me, but Mia and I much prefer hanging out in here with the rest of the neighbors.$10++Ey farmer! Looking good, what's today's costume?#$b#You like mine? Thanks! Mia and Emily made it for me, so you ought to compliment them on their work whenever you can.$9|inputSeparator=++}}",
        //Married Spirit's Eve Bodyguarding
         "halloween.002": "Sorry love, no can do. No one can come in until 1, not even if they're the hottest, smartest, most talented spouse in the world.$10#$b#Bummer, I know.",
        //Married Random Spirit's Eve Dialogue
         "halloween.003": "{{Random: You should try some of the kid's punch, love. They made it without cranberries this year and its absolutely delicious.$1++Ohhh, looking good this year, sunshine. I love your costume.++We were thinking about carving some pumpkins after the party instead of heading to the main one at the town. Picked out a few of our best from this year's harvest specifically for today$1.++Nothing like getting together with the neighbor's, kinda wish we did this more often.|inputSeparator=++}}",
        //Sterling at Pierre's
          "married.000": "Oh, hey darling. I ran a cost-efficiency calculation of Pierre's seeds earlier today and now I'm just checking what he has in stock for our production this season. Don't worry, I still remember the entire stocklist.#$b#I guess working at Pierre's did have its advantages after all.$4",
        //Sterling talking to Pierre
          "married.001": "{{Random: I'm just catching up with Pierre a little bit.#$b#Old man won't admit it, but he misses the crap out of my guts.$10++Even after working for so long the old man thinks he can one up me in price.$10#$b#I know that price sheet inside and out. I can tell a mark-up when I see one.$10 ++ Hey babe, I was just catching up on how Abigail is holding up. Probably will go say hi to her right after Pierre.++ Isn't Pierre looking nice today? I can tell he dressed up. For a man so full of himself, he seems to struggle taking a compliment though.#9|inputSeparator=++}}",
        //Random outside dialogue   
          "married.002": "{{Random: Make sure to drink plenty of water while you're outside, hotstuff. ++ You know what I'm really in the mood for? A good ol' date night. Maybe once you're done with today's errands I can pull out my bike and we can out to Zuzu City.#$b#Or maybe the scenic route along the coastline? Mmm, so many possibilities.$10#$b#Now let me kiss you before you get going. *smooch*$1 ++ Henry and I went online today and bought some cool stuff from JojaPet. Max and %pet are going to be so happy, I can't wait.$1 ++ What's up, hotstuff! Just pausing a quick minute from my run. Gotta stay active!$1 ++ Hey guess what? Mia made some extra homemade ravioli and sent me back with some tuppers of it.#$b#Looks like we're having an easy dinner tonight! I'll make us a salad.$1 ++ Nothing like fresh, valley air to make you happy to be alive!$9|inputSeparator=++}}",
        //Sunday Saloon dialogue
          "married.003": "{{Random: Glad to see you could make it, darling! Come beside me, the game is just starting.$1$#$b#Are you in?++I'm so thankful to be living so close to family now. Nothing better than kissing my husband good morning, and then catching up during a game with Henry in the evening.^I'm so thankful to be living so close to family now. Nothing better than kissing my wife good morning, and then catching up during a game with Henry in the evening.#$b#Are you joining us today, sugar?++I swear, Mia never seems to run out of recipes. Tonight she gave me a card for Chicken Alfredo.#$b#Maybe I'll try making it tonight.$9++Tonight's game's going just fine, dearest.#$b#So fine, in fact, I'll bet you three kisses and a back rub this one's on the house for team %farm.$10#$b#Now give me a kiss for good luck while I finish this up.$4++Henry, Mia and I still enjoy getting together for our Sunday game. It's now also a perfect excuse to catch up.#$b#Of course you're invited silly! You're a part of the family now. You will always be, married or not.$9++Ah! You made it love. Would you like me to get you a drink? Otherwise, you can share my soda with me.|inputSeparator}}",
        //Random Sterling Shopping
        "married.004": "{{Random: Hey beautiful.#$b#Just figured I'd take care of some weekly shopping while you were busy at the farm. Serves having all the prices memorized to do some budgeting.$1#$e#Now tell me fruity cereal or integral oats?++I got a load of stuff from the supermarket today. Pierre asked if I wanna box for it.#$b#I had to tell him wrestling was more my sport.$10++Well hello there. A handsome man wasn't on my shopping list but I can be spontaneous.^Well hello there. A pretty lady wasn't on my shopping list but I can be spontaneous.$10++Mmm... Alfredo sauce or bolognese?++Would you believe me if I said I've never bought groceries with a partner before? This is so... Domestic. It makes me warm.$4++Taking care of the groceries is really fun and all, but have I told you how much more I love seeing Pierre's salty face whenever he sees me come in out of uniform?$10#$b#... I kinda almost miss him. He's been getting a lot better. A lot more like the man I knew when I was a dumb kid.$1++%Sterling is singing some cereal's jingle as he stuffs it in his cart.++%Sterling is secretly rearranging some items. Residue of his time working at Pierre's it seems.|inputSeparator=++}}",  
        //Random Beach Dialogue
         "married.005": "{{Random:Make sure to drink plenty of water while you're outside, hotstuff. ++ You know what I'm really in the mood for? A good ol' date night. Maybe once you're done with today's errands I can pull out my bike and we can out to Zuzu City.#$b#Or maybe the scenic route along the coastline? Mmm, so many possibilities.$10#$b#Now let me kiss you before you get going. *smooch*$1 ++ Henry and I went online today and bought some cool stuff from JojaPet. Max and %pet are going to be so happy, I can't wait.$1++Let's go have a dip, love! I've been waiting for you. It's been a long day at the farm.++Man! This is why I love summer, nothing better than some good ol time with the sun, sand and ocean.#$b#Now let's go swim before I have to throw you in the ocean myself.#$b#And then rescue you, of course.$10++Look at these seashells I found along the coast? Maybe I could decorate my jars along with it...++It's such a wonderful day out today, isn't it?|inputSeparator=++}}",  
        //Random ARV House Dialogue
         "married.006": "{{Random:It's good to spend some time with Mia and Henry, catch up, see what mess they've made with my old room.$10++Mmm, sorry love. I was only gonna stay an hour, but then Mia shared some of her spaghetti and.....#$b#Saved you a plate!$10++Yoba, Max is so darned adorable... I always pretend I come here for Henry and Mia, but in truth, he's the real star of the show.$10#$b#Just don't tell Henry.|inputSeparator=++}}",  
        //Henry Help Dialogue
         "married.007": "{{Random:Don't wait up for me today, plum. I'm heading over to Grampleton to help Henry and my uncle for the afternoon. There's always lot's of work before the winter.#$b#%Sterling leans in to give you a soft kiss.++Do you need anything from town, dear? I'm heading over to Grampleton right now, I can grab anything Pierre might now sell here.++Sorry darling, I'm heading out to my uncle's farm. Do you think you could make dinner?#$b#I'll trade it for a feet rub once we lay down for the evening.++Sorry dear, I'd ask if you want to come along but my aunt and uncle are... Horrible people, to put it lightly.$3#$b#They're incredibly unpleasant to be around but... Family is family and we've always looked out for each other, if not for them, I help out for Henry.$11|inputSeparator=++}}",
        //Coming home from helping Henry
        "married.008": "{{Random:Mmm, finally on my way home after a long day's work. Would you like to walk home with me, dear?++It's always a pain having to deal with my uncle. He asks the most intrusive questions or just grunts and pretends you're not there.$6#$b#At least today is done and over with. Maybe we can have a quick, lazy dinner before bed?|inputSeparator=++}}"
      },
    },   

    {
      "LogName": "Mia Strings",
      "Action": "EditData",
      "Target": "Strings/schedules/Mia",
      "Entries": 
            {
          //Spirit's Eve Bodyguarding
           "halloween.000":"Just keeping Sterling some company while he keeps watch at the door!$1#$b#Sorry farmer, I can't let you in either. But I do hope to see you tonight at the party.$1",
          //Random Spirit's Eve Dialogue
           "halloween.001":"{{Random: .|inputSeparator=++}}",
          //Married Spirit's Eve Bodyguarding
           "halloween.002":".",
          //Married Random Spirit's Eve Dialogue
           "halloween.003":"",

          }
        },

    //Map Strings
    {
      "LogName": "Map Strings",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
          {
        //Sterling Room
          "SterlingDiary": "Sterling's laptop. It's plugged in and turned on, and when you peer at the screen you seem to find what appears to be a journal entry.#'... Got a text from Kai yesterday, he's still wondering where in the world I've been. I keep telling myself I'll respond a little bit later and by now I've all but ghosted him. Tempted to head out to the train tracks again to think, but I don't want to cause another incident... I think tonight's another blackout sort of night...'#The text goes on, but you decide not to read on further.",
          "SterlingPlant": "You realize Mia's really gone and thrown plants everywhere she can in this house. This one looks a little smaller and sturdier than the rest. Probably a good choice for Sterling.",
          "SterlingShoes.1": "You see Sterling's work boots and shoes. They're rather cruddy. He should probably get on cleaning those.",
          "SterlingShoes.2": "You see a few open shoe boxes with things like Sterling's charger and some chains.",
          "SterlingMove.1": "Sterling seems to have not unpacked most of his stuff since moving from the city.",
          "SterlingMove.2": "You peek into the box curiously and see a stuffed animal peeking back at you.",
          "SterlingMove.3": "This box is taped shut. Sterling seems to have made no effort to even begin unpacking it.",
          "SterlingFridge": "It's mostly filled with beer.",
          "SterlingNote": "It's a list of names you don't quite understand.",
        //Mia Room
          "MiaVanity": "Mia's Vanity. There's a picture of her father and a young Mia during Winter Star on her mirror. Her makeup is out and about over it, but in an organized manner you can appreciate.",
          "MiaSmell": "You take in the scent of the room. It's fresh and sweet. You conclude this is certainly very fitting of Mia.",
          "MiaSnoop": "Should you really be snooping inside someone's personal belongings, you freak?#...#You find Mia's phone charger, a brush and some sleeping pills.",
          "MiaBottle": "There's a tiny, strange vial inside with a clear liquid you don't recognize. It looks like some sort of injectable medicine?",
          "MiaClothes": "There's... A LOT of clothes in here. Mia's taken great care to press them as thinly as she could to arrange them in the commode.",
          "MiaWallpaper": "Mia has a picture of her, Henry and Max on the Grampleton farm as her wallpaper.",
          "MiaNote": "Mia's agricultural journal. She seems to be keeping track of the processes used with the company she's working for.",
          "MiaFlower": "A beautiful vase with a single flower. It seems fresh. Probably just picked from the garden or bought from Aideen.",
        //Henry Room
          "HenryNote": "Henry's notebook. It looks like he's been working on trying to balance his farm's budget.#...It doesn't look good.",
          "HenryBoots": "A pair of surprisingly clean work boots. You can see from how worn out the leather is that they've been scrubbed clean countless times over the years.",
          "HenryStand": "The top drawer is filled with generic eyeglasses. Henry must've stocked up on back ups when they were having a sale. ",
          "HenryClothes": "You open the drawer to find the largest collection of denim you've ever seen. Jeans, overalls, jackets... And for a split second, you think you may even see a pair of denim underwear.",
          "MaxBed": "A soft cozy bed for a soft cozy boy.#No, not Henry. Max. This is Max's bed. Henry sleeps in the human bed over there.",
          "HenryBookshelf.1": "This section is just full of those puzzle books your grandma used to always get at the grocery store.",
          "HenryBookshelf.2": "A collection of Farmer's Alamanacs dating back to decades ago. A dream collection for an agricultural nerd.",
          "HenryBookshelf.3": "There's a high school yearbook from Grampleton High from a few years ago. The cover is a beautiful painting of an idyllic countryside landscape.#In the corner you can see the artist's signature. 'Gloria Cooper' ",
          "HenryBookshelf.4": "'We All Lift Together' It appears to be a book about cyborg laborers being forced to work to pay off their mechanical enhancements so they don't get 'repossessed'. And also space ninjas.",
          "HenryTie": "Among other things, there's a collection of scarves hanging from the rack.#Upon closer inspection, you see that hidden with the scarves is a pre-tied neck tie. You're left to wonder who this mysterious tie belongs to, and who is the mastermind who tied it for them?",
          "MaxMedals": "A number of Max's dog show ribbons proudly put on display. None of them are for first place, but you get the feeling that Henry still couldn't be more proud.",

        //ARV House
          "ARVFrame.1": "A photo of a farm you don't recognize. It must be Henry's over in Grampleton.",
          "ARVFrame.2": "A photo   of a young Henry and a girl besides a cow. Somehow, he appeared much happier then.",
          "ARVFrame.3": "A photo of Mia and Henry. You recall them being friends for a few years now.",
          "ARVNotebook":"'Restoration Agriculture and Holistic Management.' Despite being a farmer, the page its open on feels a bit too complex to your liking. There are neat notes about it in Mia's handwriting that make it much easier to understand.",
          "ARVBookshelf.1": "Growing a Revolution: How Farming is an Act of Defiance in a Capitalist Nightmarescape.",
          "ARVBookshelf.2": "An Exercise in Scope Creep: A Self-Help book by Himetarts",
          "ARVBookshelf.3": "Overcoming Addiction & How to Cope With a Lost Family Member.",
          "ARVBookshelf.4": "It's photo albums. They appear to be Mia's.",
          "ARVTrash": "You dig your hand into the Cooper's trash with no second thought and you find...#A Gold Bar! The item has been added into your inventory.#... What? No. Of course that doesn't happen. If anything you find a few yogurt containers and used paper towels. What kind of person digs into someone's trash, you freak?#If anything, you now have some lint and a bit of a smelly arm to show for your efforts.",
          "ARVShoes": "You find shoes neatly stacked of many shapes and sizes. Someone's been doing a good job of keeping them clean... Except for Sterling's which you recognize as much more of an obvious mess.",
          "ARVFridge.1": "You find some frozen lollipops and meats. Ice is starting to build up. Suddenly you don't feel as bad for yourself.",
          "ARVFridge.2": "The display of neatly lined and organized fresh, beautiful looking goods and harvest from Mia's garden puts even Pierre's to shame. Everything seems to be painstakingly labelled too with bottling dates, and warnings about what Mia will be baking with.#Suddenly, you feel shame at the state of your fridge. Maybe you should do some shopping...",
          "ARVFridge.3": "Meal prep that Mia has set out for tonight's dinner. Your mouth waters, and resolve to go home and cook a big meal for yourself tonight. As a treat.",
          "MiaPie": "Mia's made pie! It's {{Random:Blueberry, Raspberry, Strawberry, Apricot, Sheppard's, Melon, Bean...?}} Pie!",
          "MaxBowl.1": "Good quality kibble for best boy.",
          "MaxBowl.2": "Fresh water for best boy.",
          //Spouse Room Sterling
          "SterlingConsole": "Sterling's Z-Box he brought all the way from Zuzu City. It makes a funny noise when it starts up now.",
          "SterlingControllers": "As you fondly gaze at the second controller Sterling bought to play with you, you wonder why in the world Yoba couldn't just give you a man who'd let you win from time to time. Like a normal husband.",
          "SterlingTherapyPlant": "Sterling's Therapy Plant! When you asked him what he meant, he responded she was here to help him get to the root of his problems!#You swiftly punched him in the arm.",
          "SterlingPhotographs": "You gaze up at the photos Sterling hung on his wall. You can see a child picture of him smiling through crooked teeth.#A photo of Henry and him when they were teenagers, both were still quite lanky.#And lastly a photo of the two of you from your last ride out of town. It was a wonderful day.",
          "RoomSterlingShoes.1": "Sterling's work boots, he seems to have actually polished them! As well as a pair of sneakers he should probably replace by now.",
          "RoomSterlingShoes.2": "Your own farming boots, as well as your nice shoes that Sterling's painstakingly cleaned and polished. They make you look forwards to your next date.",
          "RoomSterlingFlowerVase": "Some seasonal flowers Sterling's helped you grow and arranged himself. #He seems to be growing less and less self conscious about his love for flowers.",
          "RoomSterlingDiary": "Comfortable with your communication with Sterling, you decided not to snoop in his personal diary files.",
          "RoomSterlingTV.1": "It's good to see Sterling finally unpacked his boxes when he moved in with you. You had no idea he'd brought his TV from Zuzu City!",
          "RoomSterlingTV.2": "You carefully sort through the movies and settle on {{Random:Wumbus 2: Electric Wubaloo++It's Always Hailing in the Valley++Eternal Whine of a Useless Mind++Attack of the Killer Tomatoes!++Wee Movie|inputSeparator=++}} for movie night tonight.",
          "RoomSterlingTV.3": "It's a really nice TV! You're still bummed out it's also only capable of playing three channels.",
          "RoomSterlingFridge": "It contains the snacks for movie night.#You're content with the idea Sterling had for it, as neither of you ever liked getting up all the way to the kitchen when the movie gets good.",
          "RoomSterlingPlant": "A flower plant Sterling is nurturing. You feel warm knowing your green thumb is rubbing off on him."
          }
    },
     //Diary Post 1st Date
     {
      "LogName": "Diary",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
      {
        "SterlingDiary": "'... I'm feeling pumped. Like. Bouncy. It feels good to actually DO things, with people. I practically forgot about my beer. When was the last time I did anything for fun without alcohol with my friends back home? Or... Here, for that matter...'", //hap after dates
      },
      "When": {"HasSeenEvent": "40180005"}
    },
    //Diary Post 2nd Date
     {
      "LogName": "Diary",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
      {
        "SterlingDiary": "... I feel STRONG? Like, who knew what fresh air and some nightly splashes could really do to a person. And! The good company! I knew moving was the right choice but, it's finally actually starting to feel that way. I'm looking at my phone, and suddenly responding to that text from Kai doesn't feel as daunting. Maybe I'll finally tackle it. Tackle him....",
      },
      "When": {"HasSeenEvent": "40180006"}
    },
    //Diary
     {
      "LogName": "Diary",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
      {
        "SterlingDiary": "'... aaaaaaaaa . i don't know what to do about getting antsy. i know my shrink said even if i didn't visit keeping a journal would be healthy, but she didn't say what to do with all these... /shakes/. #what if i just do... something, something mild. maybe some pills or something, just to cut away at the edge. #fuck, its been so long. maybe not. idk...'", //thinking about drugs
      },
      "When": {"HasSeenEvent": "40180007",
              "Hearts:Sterling": "5,6"}
    },
      //Diary Relapse
      {
        "LogName": "Diary",
        "Action": "EditData",
        "Target": "strings/StringsFromMaps",
        "Entries": 
        {
          "SterlingDiary": "'... shit, shit fuck fck ck sshit fk...'#This entry seems to go on like this for long. It isn't exactly comprehensible. You figure you better stop reading.", //relapse
        },
        "When": {"HasSeenEvent": "40180008",  }
      },
      //Diary It's gonna be OK
      {
        "LogName": "Diary",
        "Action": "EditData",
        "Target": "strings/StringsFromMaps",
        "Entries": 
        {
          "SterlingDiary": "... just... How many times do I need to be saved from my old bullshit? Ahh... I feel ashamed. And stupid. And... Like that's okay? It's okay. I think, I think I can do better. Feels so shit it's somehow uplifting that there's no other way but up from here and for the first time I can actually see that light all the way up there. I believe that. I believe that.'#The entry seems to end there.", 
        },
        "When": {"HasSeenEvent": "40180009",  }
      },
     //Diary Dating
     {
      "LogName": "Diary",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
      {
        "SterlingDiary": "'AHHHHHHHHHHHHHHHHHHHHHH'#You skip over the long exclamation. 'I feel like a kid who got Winter Star early. But instead of a six-pack I got something precious and expensive as a gift. Beautiful. Fragile. Like I need to handle it with care and polish it whenever I am able to. It's... It feels undeserved, but I'll work to feel like I'm worth it being mine.'#'After Kai, I never thought I could handle someone coming after, but now... The future. It feels bright. It feels wonderful. I'll treasure it as best I can.'#Feeling your cheeks redden and your face heat up, you step away from Sterling's computer. Dork.", 
      },
      "When": {"HasSeenEvent": "40180009",
               "Relationship:Sterling": "Dating"  }
    },
    //Diary Pledges Away from Alcohol
    {
      "LogName": "Diary",
      "Action": "EditData",
      "Target": "strings/StringsFromMaps",
      "Entries": 
      {
        "SterlingDiary": "There is only his home screen. The wallpaper is a picture of you walking through your own fields of sunflowers. You're looking back at the camera with a bright smile.",
        "SterlingFridge": "Sterling's fridge sits empty.",
        "SterlingShoes.1": "It appears as though Sterling cleaned up his shoes."
      },
      "When": {"HasSeenEvent": "40180010",  }
    },
    

    ]
}
    