{
    "Changes": 
    [
        {
        
            "LogName": "Normal Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/MarriageDialogueSterling",
            "Entries": 																																	
            {
                //SPECIAL DATES    
                "patio_Sterling": "{{Random: Hi honey! Just taking in the sights and getting some nice, fresh air.#$b#Though I have to say the sights have improved considerably now you're standing right in front of me.$10 ++ I was thinking of maybe setting up an outdoor canning station? So I don't end up filling up the kitchen with all that mess every time. ++ Hi darling! Just watching %pet running around and taking in the heat... I saw a butterfly lay on them earlier, I should've taken a picture. ++ Nothing like a good ol workout to clear the head!|inputSeparator=++}}",
                "spouseRoom_Sterling": "{{Random: It's so good to finally have been able to unpack all my stuff and see it all nice and set out.#$b#Back in the city, they were always a mess... And when I moved in with Henry I never got around to unpacking my stuff.$3#$b#I don't know, I guess it felt too... Permanent, when I feared he might grow tired of me and kick me out at any moment. Even if I knew he never would...#$e#So happy I found my 'permanent' with you.$1 ++ Hey love! I was sorting through my old game copies and found Mega Smash Sisters Brawl; we should do a round or two at some point later if you're free.$9 ++ I'm just watering the flowers, love. Is there anything I can help you with? ++ You know Henry checks the TV every morning before starting his day? I always thought it was silly, but now I don't live with him I can't help to have picked after his habit.$9 ++ One of the biggest things I've been working on is trying to keep my life organized.#$b#That starts with the things we own of course. Clean space, clear head. Happy spouse, happy life!$1++To think I used to live in an apartment this big.$1#$b#Yeah, I had all of these big plans of going to college and getting the whole city experience. Crappy studio included.$13#$b#Honestly I was just giving myself excuses to be lazy and miserable.++If we ever have too many kids we can just remodel this space into additional room for them.#$b#If you want them, of course. I can't imagine myself getting tired of being a father to your children.++Just picking out a movie for us to watch tonight, darling.#$b#...'It's Always Sunny in the Valley'...$11#$b#Well that sounds incredibly boring. Who's watching something like that?$3++Oh don't come at me that it's some heartfelt story. I'll give you a heartfelt story, you mischievous pumpkin.$10++Would you mind if I added some more pictures of Henry and Mia?...I really miss them.#$b#Oh, we could have them over for dinner too. Let me go ahead and call them.++Mmm, our couch is just so comfortable to snuggle in.$4#$b#I picked my couch back in the city out of a dumpster. It was serviceable, but I tragically made out with girls I brought over in it.$10#$b#Buying this bad boy is some real character development for me.$10#$b#I promise to keep it clean, dear.$3++I'm going out later to replenish the mini fridge, is there anything you're craving, moppet?#$b#All this time later, I still expect to find it full of beer every time I open it.$2#$b#I'll just keep having to fill it with tasty snacks until that replaces that image in my head, I suppose.$4#$b#Thank you for your patience, dear.++Who could've guessed playing videogames sober is a much more engaging experience?$1#$b#I had to delete around 7 strangely named saves. I have no idea what I was doing in most of these.$3++Henry and I were always a strange pair. Even as kids, we didn't have all that much in common other than being farm boys.#$b#Oh, but we got up to so much trouble together. He was so much more carefree back then.$10#$b#Just looking at the pictures and reminscing. Things were never quite the same after Gloria passed away. I miss her every day.#$b#Just don't let him know I told you about her.$3|inputSeparator=++}}",
                "funLeave_Sterling": "I'm on my way to go help Henry over at Grampleton, is there anything we need from the city?",
                "funReturn_Sterling": "Man I am *beat* after spending the day with my uncle.#$b#Working on the farm with you is so much more pleasant than Henry's dad's over at Grampleton.$6#$e#Hopefully %farm will never have to struggle like that.#0",
                "spring_Sterling": "Spring is one of my favorite seasons, it was so much potential.#$b#Potential for what you say? Well, why don't we get together tonight and test the spring potential of our mattress, dearest?$10",
                "spring_8": "It's Mia's birthday today, so I'm probably going back to East Scarpe for the afternoon to celebrate with them.#$b#I said I'd bring you over no matter what so don't forget to come say hi once you're through today's tasks, alright angel?#$b#I love you, see you then.#$e#Oh and! You should give this to Mia. [421]",
                "spring_13": "Listen here honey. We need to have a serious talk.$11#$b#You. Need. To. Win. For us, today. You hear me?#$b#Don't you dare let Abigail win, and we'll see in what ways I can spoil you as soon as we're back, angel.#$e#What? I need bragging rights for Henry and Mia! I'm counting on you!$1",
                "spring_23": "I can't believe we did not get to dance together on your first year here. I truly was a fool.#$b#I hope you're excited for the Flower Dance tomorrow. I've been polishing my steps for you, poppet.$10", 
                "spring_24": "Honey, could you help me with my tie? I can tie it myself, but your knots are so much better than mine.#$b#I guess I'm a little out of practice, don't have the occasion to dress up that much nowadays.$9#$b#Other than for you, of course. I hope you're excited for the dance, honey.$10",
                "spring_20": "Oh hi, dearest.$2#$b#Sorry dear, you didn't do anything wrong. I was just thinking of how it's Shane's birthday today. I'm not... I'm not sure if I should reach out.$12#$e#... Does it get easier missing someone who's bad for you?$5#$e#...I think I'll leave him some pepper poppers with Marnie.",
                "spring_28": "Are you excited for Summer, my love? You and I will be hitting the beach plenty, so I hope you can make some time.$10#$b#I'll pack us the refreshments and snacks!$9#$e#I'll have Mia teach me how to make Melon Mint Sorbet, I bet you might enjoy that.$1",
                "summer_11": "I packed some hot sauce to put into the potluck today, did you keep something already?#$b#Let's be real, anything coming from %farm will be to die for. $1",
                "summer_Sterling": "I've considered just hanging around the farm shirtless now it's summer.#$b#I'd hate to do that to the neighbors though.$10",
                "summer_15": "Mmm, no better birthday gift than a kiss from you first thing in the morning. Thank you, darling.$4#$b#I'm not one for celebrations so I'd be alright with just having Mia and Henry over for dinner.$1#$b#... Or we could stay home and celebrate it in our bedroom...$4", 
                "summer_28": "Lover! Are you ready to get spooky?$10#$e#What do you mean it's *only* the first day of Fall? The spooky season lives within us all.$1",
                "fall_Sterling": "Are you planning on growing cranberries this season, darling?#$b#Just be sure to tell me if you do, I'm still very allergic.$3#$e#You won't like me with a puffy red face, I assure you.$3",
                "fall_15": "Mmm, there's my future Fair winner. Are you ready to put some old people to shame tomorrow?$10#$b#I canned us some fresh jam for the display, I hope they like it as much as you do.[344]$13",
                "fall_16": "If you listen closely, you can hear the wails of the su-$10#$b#Ow! Okay. Fine, no scary stories until Spirit's Eve. But you won't escape them then.",
                "fall_23": "I'll be headng out today to celebrate Henry's birthday, you should come with if you have any time after your errands.$13#$b#.... We'll be *trying* to celebrate anyway, you know how he is with being glued to his work.#$e#Even Mia's cake struggles dissuading him.$3",
                "fall_26": "Maze tomorrow. Inn party tomorrow. So much, *so much* pumpkin soup and spice latte tomorrow.$13",
                "winter_Sterling": "It's a little chilly outside, poppet. Here, grab my hoodie before you go.#$b#I don't want you getting sick out there. *smooch*#$e#Then again, good excuse to have you to myself all day.",
                "winter_7": "I can't pretend I'll be any competition for Henry tomorrow, man knows his way around a fishing pole.#$b#You'll be the one I'll be cheering for at the ice festival tomorrow, though.",
                "winter_24": "I don't really care about what gift I get tomorrow because my biggest gift is already you.#$e#Though a new jacket would be pretty nice, I hope Emily's got me.",
                "winter_28": "Mmm... New year and more time to spend with my favorite person in the world.#$b#Can't wait to kiss you like you've never been kissed during the countdown.",
                
                //GENERIC DIALOGUE
            
                "Rainy_Day_0": "{{Random:Hey love, I made you some coffee for the way. [395]#$e#Don't push yourself too much out there, alright?#$e#I'll get you in trouble if you do, trust me.$10++I went out water %pet 's bowl and it appears mother nature had other plans for me.$14#$b#At least we'll be saving on the water bill this month.$17++Mmm, this is some doing no work and cuddling under the bedsheets kind of weather. Makes you not want to do anything#$b#I know I can't convince you to stay in, so have a good day out there darling.++I know that look in your face. It's a going out to the mines kind of day, isn't it?$10#$b#Be very careful out there. I'm going to be very upset if I get called in by Harvey again saying you're in emergency care.$11#$b#Me and %pet need you in one piece, alright?$0++Back in the city, I had days so bad I couldn't even get up and go to work when the day looked like this.$1#$b#Unsurprisingly, I couldn't really hold any jobs because of it.#$b#Ah, the good old days of drug riddled depression.$4#$b#Feels like a priviledge to be able to wake up and exist every morning.++Did you grab your raincoat?$11#$b#And a scarf?$11#$b#You have a pocket umbrella on top of your regular umbrella just in case?$0#$b#Don't forget my kiss.#$b#Have an excellent day, darling.|inputSeparator=++}}",
                "Rainy_Day_1": "If there's something I learned in all my years of being an idiot, it's that no relationship is all sunshine.#$b#But two people can share one umbrella and survive the storm together.",
                "Rainy_Day_2": "Since it's raining today, I'm thinking about staying inside and washing %pet . It'll curve the temptation to head to the saloon.#$e#Don't catch a cold out there, okay? Or I'll be the one to wash you when you're home.$10#$e#I'm a scream away if you need help, hotstuff.$1",
                "Rainy_Day_3": "Rainy days are so much different out in the valley. Back in the city all I wanted to do was watch TV with a beer to drown out the sounds of couple hurrying back into their homes.#$b#The weather now makes me want to go outside and take you dancing in the rain.#$e#And distract myself from wanting that beer regardless.$3",
                "Rainy_Day_4": "Good morning love, I made us some breakfast. Eat up because I'm joining you with the animals today.[211 350 210]#$e#What? I don't care that it's muddy.$10#$b#You could roll around the mud for ten minutes and you'd still be the most breath taking creature I've ever laid my eyes upon.$10",
                "Rainy_Day_5": "I've been practicing my canning skills while you work lately. I'll probably stay in and make some jam you can share with the townsfolk.#$e#Just make sure to tell them it was from you, they'll probably think it lame.$3#$e#... Would you like a taste before you go, love?[344]$1",
                "Rainy_Day_6": "Man... It's always raining in the valley, isn't it?",
                "Rainy_Night_0": "{{Random: Mmm, it's on nights like this that you really remind me of a thunderstorm.#$b#You're just positively striking, my love.$10++Ugh. Finally done with your day too?$1#$b#Good. I just want to spend the rest of the night cuddling. We can ask Gus for some takeout.++Have you written to your parents lately?#$b#I put away some of your old letters today, just made me think of that.#$b#I never met my mother, but sometimes I like to imagine she's been writing letters to me this whole time, and just doesn't know where to send them to.$4#$b#It's alright, my real family is right here, and it's everything I've ever asked for.++I had a dream I was getting rained on in some poorly lit alley while high off my mind.$12#$b#I felt terrified waking up.$6#$b#I'm fine. I just have no idea how I used to live like that, willingly for that matter.$11#$b#City Sterling was made of different stuff, I think.++I set your PJs by the fire so they should be nice and cozy for you to put on.#$b#Don't worry, I was paying attention them.$3|inputSeparator=++}}",
                "Rainy_Night_1": "Mmm... What if we take the rest of today off, and cuddle under the covers?#$e#... Maybe do some more under said covers.$10",
                "Rainy_Night_2": "Here darling, give me your hands. I don't want them to be cold in this chilly night.#$e#Can't have you getting sick, unless you want me to nurse you back to health so bad.$13",
                "Rainy_Night_3": "For the love of Yoba, you're soaking wet, love.$7#$b#Come here, let's get you out of those clothes into something warmer.#$b#Or into my arms, in whatever order you may prefer.$10",
                "Rainy_Night_4": "Oh hey love, glad you're finally home.$14#$b#Oh, don't worry about it, I just went out for a jog on the rain. It always clears my mind, nothing wrong, I promise.$15#$e#Why don't you help me out of these clothes, and then we can spend the rest of the night together?$17",
                "Rainy_Night_5": "If you need anything else from outside, please be sure to tell me, sugarcups.#$b#I'd rather you not have to go outside and wet yourself, you've worked hard enough already.#$e#Why don't you lay down so I can give you a massage if there's nothing else you need?#$e#Just a massage, I swear it!$13",
                "Rainy_Night_6": "I got so much done today! I guess that's the power of staying in and being able to fully concentrate.#$b#Nothing better than a rainy day to get work done... And a rainy evening to cuddle the most attractive person that ever lived.#$e# %pet , of course. #$e#You can come cuddle too!$13",
                "Rainy_Night_Sterling": "I hope you're hungry, starshine. I scrambled something up while waiting for you to get home.[240 241 224 215 213 211]",
                "Indoor_Day_0": "{{Random:Oh, but if it isn't my delicious little starfruit. Did you license get suspended for driving all these guys crazy?#$b#Get on with your day before I find myself stealing you up all for myself.#$e#And take this, I just brewed it. [395]++Hey. I know Henry is a little difficult to get to know, but give him a chance if you can.#$b#He's had a very difficult time in life, which has closed him up quite a little. But he needs good people in his life.#$b#And we're family now right? Tell you what, what if I make us some dinner and we invite Mia and Henry?++I know you love doing everything by hand, but if sit down and plan it out, we could probably get a tractor and make your life easier, sugar.#$b#Don't worry about the maintnance, I've been helping my uncle with their old machine since I was 16. I've got the hang of those beasts by now.$1|inputSeparator=++}}",
                "Indoor_Day_1": "I hate having to wake up this early but, *yawn* I wanted to get up to help you water everything first thing in the mor- *yawn*#$b#Coffee? *yaaaaaaawn* [395]",
                "Indoor_Day_2": "Good morning, poppet. I'm thinking I might head out to check up on Henry once I'm done feeding the animals.#$b#I made you some breakfast before I go, though. Don't go out there without a full stomach. [211 350 210]",
                "Indoor_Day_3": "Excuse me, sir. Where is it exactly you think you're going without giving me a kiss first?^Excuse me, missus. Where is it exactly you think you're going without giving me a kiss first?#$#%Sterling leans in for a tender kiss.#$b#Have a wonderful day, darling. Now give me another kiss.",
                "Indoor_Day_4": "Mmm, I never knew how much I enjoyed being surrounded by flowers. I hope we can grow some more this season.",
                "Indoor_Day_5": "I'm gonna do some laundry today, so be sure to leave everything in the hamper if you can, dearest. Coffee is on the counter. [253]#$e#Betcha a depressed person couldn't fold all THIS. *flex*$1",
                "Indoor_Night_0": "Mmm, I've been looking forward to holding your handsome face for just about the whole day.^Mmm, I've been looking forward to holding your pretty face for just about the whole day.#$b#Would you do a poor, yearning man the honor?",
                "Indoor_Night_1": "*sigh* $d#$b#....I'd like to take you to the movies, but they don't let you bring in your own snacks.$2#$b#And how could I possibly go anywhere without my favorite snack? *kiss* $1",
                "Indoor_Night_2": "You must be exhausted love, because you've been running through my mind all day.#$b#%Sterling pulls you in for a quick kiss.#$b#How about I make dinner tonight?",
                "Indoor_Night_3": "I tried cleaning the place up while you were gone... I'm not sure if I did it right, you'll have to forgive me.$3#$b#But at least every one of your tools is in its correct place. Not a thing out of order. I hope that can help at least.",
                "Indoor_Night_4": "Got a text from one of my old buds from the city. Thought I had all their numbers blocked.$5#$e#I hope I'm making the right choice... It shouldn't feel this weird by now, should it?$2",
                "Indoor_Night_5": "My muscles feel incredibly sore, feels like my whole body is killing me.$6#$b#Come here, poppet. Why don't I draw us a hot bad after a hard day and we can share it? I'll massage your back,#$b#and you can help me with my shoulders after.",
                "Indoor_Night_6": "Mmmm, I'm feeling incredibly restless after today. Can't seem to shake off all the extra energy.#$b#I might run a night lap around the farm, wait up for me alright?#$e#Just the farm. No saloon, promise.$11",
                "Indoor_Night_Sterling": "Why don't we huddle up on the couch and cuddle with our TV show before bed? I whipped up some quick dinner before you came home. [215 224 206 212 231]",
                "Outdoor_0": "I can't believe how ungrateful I used to be about the valley when I was a kid. All I wanted to do was leave the farmlands behind.#$b#Now I'm so thankful to be home. Call this home. Call you home.#$e#Don't get too busy, okay? Call if you need extra aid today, I'll be with the animals.",
                "Outdoor_1": "I can't tell what's more beautiful, the weather today or you.#$b#It's making me want to take %pet outside for a stroll. Look for some wild berries. You should come with me.$1",
                "Outdoor_2": "I think we should get %pet a little brother. Sorry, I just love animals so much.$13#$b#But I think we could make another bud really happy with al this farm it'd have to run on.$1",
                "Outdoor_3": "Just enjoying some fresh air before starting my day. Nothing like a beautiful view to cure all ailments, don't you think?#$b#Oh yeah! The farm is pretty too.$10#$e#Alright, I'll be heading out in a minute. Give me a kiss before you leave.$0",
                "Outdoor_4": "We could probably open a stand to man directly during high traffic seasons. We're right next to the bus stop after all.#$b#You'd have the hottest man alive manning it for you, of course. *wink*",
                "Outdoor_Sterling": "Hey hotstuff, just grabbing some fresh air and admiring all the crazy work you do around here... It's something else, you know?#$b#I'm very proud of you. You really inspire me every day.#$e$Thank you. *smooch*",
                "OneKid_0": "{{Random:Today I learned that hell hath no fury like a toddler who's sandwich has been cut into squares when they wanted triangles.$3#$b#It's a good thing that %kid1 looks so much like you, it's hard to get frustrated with such an adorable little thing.#$e#... But for real, could I have a hand with their sandwiches?$3++There was this quote I read once.$4#$b#It said, love is our true destiny. We don't find the meaning of life by ourselves alone.$4#$b#We find it in one another.#$b#I used to think it was kind of corny but... Becoming a dad really changes things. I think it perfectly describes how I feel about %kid1.|inputSeparator=++}}",
                "OneKid_1": "{{Random:*sighs*$4#$b#I.... I'm just so happy, @.#$b#You, %kid1 , %pet , have made me the happiest man alive... Thank you. I love you more than words can even describe.$1#$e#That being said I'm going to need an extra 10 minutes to mop the floor because the gremlins have stunk up the house.$10++Little %kid1 decided they'd be helping me clean your tools today.$10#$b#They spilled some grease, spooked a chicken and almost had a shovel fall on them. So I think it's clear we'll leave the big dreams of becoming a mechanic for when they're older.$3++It's a shame Jas is growing up so fast.#$b#I would've loved to see her play with %kid1.#$e#Maybe Shane will have kids of his own someday?$4|inputSeparator=++}",
                "OneKid_3": "Mia offered to babysit %kid1 like she does for Eloise and the neighborhood children if we ever wanted to have an alone night.#$b#It was incredibly tempting at first, but the more I think about leaving %kid1's side the more I think loud nights are just fine.#$b#I don't ever wanna leave their side, I don't know how I'll do it when they grow...$4#$e#But if you ever want to take her up on that offer, do let me know.$9",
                "OneKid_4": "I'm not half as skilled as Mia, but I made %kid1 some bear shaped pancakes for breakfast. The strawberries are the bow tie!$9#$b#I made you some too, love. My favorite honey-bear. *smooch* {{spacechase0.JsonAssets/ObjectId:Bear Pancakes}}",
                "TwoKids_0":"{{Random:I've learned so much from our children, I'm so thankful for the experience every day.#$b#Like how parenthood is a journey except it's just traveling from room to room putting away the same toys all day long.$9#$e#And mostly just informing kids how many more minutes they have of something.$10++I used to really enjoy the quiet of living in a farm.#$b#... Then we had kids. Have you seen them? This is incredibly suspicious.$7++%kid1 got me a 'World's best dad' mug. Now we know they're sarcastic.$10|inputSeparator=++}}",
                "TwoKids_1": "{{Random:You know, having children is like living in a frat house — nobody sleeps, everything's broken, and there's a lot of throwing up.$9#$e#It's a good thing they have us here to love them, thank you for blessing me with the most beautiful kids, @. #$b#The three of you are the loves of my life.$4++Hi- Dear, uh--$11#$b#Uhm. Sorry. I got up to feed Cookie and Muffin but I just... I don't think I'm doing well today.$6#$b#I'm sorry, could you take over? I think I need to go back to bed before I do something stupid...$12#$b#I love you, though.$0#$e#Sorry love, it's a bad day for my withdrawals.$6++I want to be there for %kid1 and %kid2 forever.$12#$b#Today I thought back to sitting on my couch in the city, feeling so empty and alone I drank myself into oblivion...#12#$b#I just never want either of them to feel that way. I want to be a phone call away, always. When they're doing good and when they made mistakes.$11#$b#Sorry.$2#$b#I didn't mean to get this intense.$11#$b#I just... Want to be a good dad for them.#0#$b#I want us to do good by them.|inputSeparator=++}}",
                "TwoKids_2": "{{Random:Man, having one child makes you a parent. Having two kids makes you a referee.$1#$b#No wonder our parents hated when Henry and I got together. We were the worst. I can't imagine as babies.$9++Sometimes I wish my father had been a good man, worthy of meeting his grandchildren.$4#$b#It's no use trying, sugar. I don't even know where he is. I don't even think I care to know.$0#$b#The only family that matters is right here in this house.#$e#Besides, I love my in-laws, and they are quite enough.$10++Good morning, sugar. That's yet another tally to add to the 'Days you rolled out of bed looking positively perfect.$1#$e#I'm keeping track. Our calendar has gets a tally daily.$10++Today looks like a great day to roll in the mud with the kids and %pet. Will you be joining us?$1#$b#It's totally for the kids, hotstuff. Don't give me that look.$10++Could you grab %kid2, poppet? I'm grabbing %kid1 with me to clean up the barn, and then working on the bike.$1#$b#I think we might be having ourselves a little engineer in the family.$10#$e#Meet you back for lunch, alright?|inputSeparator=++}",
                "TwoKids_3": "Today was a rough day, but nothing beats coming home and cuddling with the three of you.#$b#Four! Sorry %pet , I can't possibly leave them out of the couch cuddle puddle.#$e#... Though don't tell the kids, but the part where we put them all to bed and you and I cuddle under the covers is by far my favorite.$10",
                "TwoKids_4": "So. Summary. %kid1 started cartwheeling all around the house, %kid2 decided they'd challenge %kid1 to an honor match and when I called them for lunch-#$b#They both decided they were astronauts galavanting through space and only astronauts can hear astronauts.#$b#Then I learned the quickest way for a parent to get a child's attention is to sit down and look comfortable.$9#$e#*sighs* One day you're getting shitfaced behind a Zuzu City dumpster, and another one you're a dad declaring ownership over swept dirt on the kitchen floor yelling after them.$10",
            
                //AFFECTION DIALOGUE
            
                "Good_0": "%Sterling seems pretty quiet this morning#$b#... Oh, I'm sorry, not trying to ignore you darling. I just headed to Pierre's and almost bought a beer on the way out.$2#$b#When I realized I then thought, fuck it... It's not like he'd find out.^When I realized I then thought, fuck it... It's not like she'd find out.$2#$b#I didn't though, I promise. Badly as I might've wanted to... Guess this'll be harder than I thought.$11#$e#Bought you a treat from the store though. [243 223 233]",
                "Good_1": "Good morning, sweetheart. Got you a treat before you head out.[243]#$b#A lollipop for the sweetest lollipop I have ever met.$10#$e#Have a good day at work, alright?",
                "Good_2": "I hope you know CPR, because you are taking my breath away this morning!$10#$b#%Sterling pulls you in for a tender kiss.#$b#What am I to do with you? Can't possibly be THIS perfect.$1",
                "Good_3": "Mmm... I must have moved into a museum, because my husband looks like a work of art.$4^Mmm... I must have moved into a museum, because my wife looks like a work of art.$4",
                "Good_4": "Oh, darling. Come closer, there's something stuck on your face.#$b#%Sterling leans in to steal a peck from your lips.#$b#There! All fixed up.$1",
                "Good_5": "I played with Eloise today on my way back from East Scarpe. She grows so fast!",
                "Good_6": "... Do I tell you how grateful I am for you enough?#$b#Because I think I should say it even more. Meeting you was the best thing that's even happened to me. Thank you.#$b#Now give me a kiss before I get self conscious. I'd never felt this comfortable with anyone.$4",
                "Good_8": "Woah there, cowboy. Did the sun come out or did you just smile at me?$10^Woah there, sugar. Did the sun come out or did you just smile at me?$10#$b#I swear, if it weren't for that damned sun you'd be the hottest thing alive today.$10",
                "Good_9": "Hey lover! Why did the ketchup blush?$10#$b#He saw the salad dressing!$13#$e#Speaking off, do you need any help with those clothes?$10",
                "Neutral_0": "I did some work on the old faithful today, before she gets rusty from lack of use.$10#$b#I cleaned your tools while at it, you should find everything nicely stacked in the garage. Let me know if you can't find anything.",
                "Neutral_1": "%Sterling seems rather greasy, probably from working on his bike. Best let him get into the shower first.",
                "Neutral_2": "How do you think Shane might be doing? I hope he's not still spending every evening at the Saloon still...$5",
                "Neutral_3": "I thought the fighting with Henry might end once I got out of their hair... I didn't want to make a drama out of my visit today.$5#$b#Well, I guess that's just family for you. You get married but they're still the same annoying bunch you love so much.$1#$b#When we fight, I just remind myself how much I love them. Just like I do with you. It's so much healthier.$2",
                "Neutral_4": "I was thinking on going for a ride later tonight. I'd love to go together if you don't have many errands today.",
                "Neutral_5": "Morning, cowboy^Morning, princess.#$b#Packed you last night's leftovers for today, it's not much, but I hope you can enjoy them. [206 215 226]",
                "Neutral_6": "I went to visit Mia and Henry today, bumped into Aideen instead.#$b#Surprisingly, the experience wasn't all dreadful. Bought this for you from her, I thought you might like them. [421 591  595]",
                "Neutral_8": "I swung by the library today. I can't believe I hadn't been in one since I first left the valley.#$b#I borrowed a book on summer crops. I know Mia is much better at all of this stuff but I figured I might start learning to help you.$4#$e#I also picked out a romance. It's actually really good. It has fairies, magic and plenty of flowers.$9",
                "Bad_0": "...$6#$b#%Sterling seems to struggling with keeping his shaking in check. He's trying to avoid you.",
                "Bad_1": "Hey love, if you were a library book, I would check you... *sigh* Sorry, that's so lame.$2#$b#Sorry love, just not... My day today. I'm struggling to feel like myself.$2#$e#No one told me addiction would be this much of a bitch when I had my first beer.$12",
                "Bad_2": "%Sterling is staring at his phone quietly. There doesn't appear to be much on the screen.",
                "Bad_3": "@. Not today. Not. Right now.$9$#e#You hurt me last night. I need... Time to think.$5",
                "Bad_4": "Hey love, you know I love you more than anything in the world, right?$11#$b#Good, please don't... Forget that. It's just a bad day today, don't really want to talk. If that's okay.$5",
                "Bad_5": "I think... I think I need to stay home today. I feel like if I step one foot outside I'll head straight for the saloon.$5#$b#...Sorry love, think you can cover for me today? I'll make it up to you as soon as I feel a little more like myself.$6",
                "Bad_6": "Morning, @.$6#$b#No, I'm not hungover. I don't... It hurts when you say those things.$5#$e#Just a bad day, woke up with the nausea killing me. No one told me going through twice the withdrawal would be this hard.$6#$b#I think I need to lay down, I love you @.",
                "Bad_7": "I can feel myself slip into my bad habits from previous relationships when we fight like this. I hate it.$2#$b#I'll work through it, I promise. Just promise to talk more to me, alright? Communicate.$11#$e#... I love you, @. I want you to be sure of that above anything else.$1",
                "Bad_8": "Look @ I... I love you. I don't want us to be like... It was with everyone else.$12#$b#I don't want to fight, please tell me how we can talk this through. There must be a way.$12"
            
            
            }
            
            //(0 = up, 1 = right, 2 = down, 3 = left)
            
        },
        {
            "LogName": "Dirty Dialogue",
            "Action": "editData",
            "Target": "Characters/Dialogue/MarriageDialogueSterling",
            "When": {
            "SpicyDialogue": "true"
            },
            "Entries": 																												 
            {
            
               "Rainy_Day_0": " {{Random:Hey love, I made you some coffee for the way. [395]#$e#Don't push yourself too much out there, alright?#$e#I'll get you in trouble if you do, because I can push you much harder.$10#$b#Then you won't be walking anywhere any time soon.$10++I went out water %pet 's bowl and it appears mother nature had other plans for me.$14#$b#At least we'll be saving on the water bill this month.$17++Mmm, this is some doing no work and cuddling under the bedsheets kind of weather. Makes you not want to do anything#$b#I know I can't convince you to stay in, so have a good day out there darling.++I know that look in your face. It's a going out to the mines kind of day, isn't it?$10#$b#Be very careful out there. I'm going to be very upset if I get called in by Harvey again saying you're in emergency care.$11#$b#Me and %pet need you in one piece, alright?$0++Back in the city, I had days so bad I couldn't even get up and go to work when the day looked like this.$1#$b#Unsurprisingly, I couldn't really hold any jobs because of it.#$b#Ah, the good old days of drug riddled depression.$4#$b#Feels like a priviledge to be able to wake up and exist every morning.++Did you grab your raincoat?$11#$b#And a scarf?$11#$b#You have a pocket umbrella on top of your regular umbrella just in case?$0#$b#Don't forget my kiss.#$b#Have an excellent day, darling.++Mmmm, why good morning, hotstuff.#$b#You suddenly look a little like an umbrella because I'm really needing to get under you right about now.$10++Come back to bed, sugar, it's all cold and wet outside.#$b#I hear skin to skin contact is specially useful to prevent hypothermia.|inputSeparator=++}}", 
               "Rainy_Night_2": "{{Random:Was it supposed to rain today? 'Cause it looks like there's a 100% chance of you getting wet. ++ Hey darling, do you know how a thunderstorm is similar to intimacy?$10#$b#Well darling, you just never know how many inches you'll get or how long it'll last.$10|inputSeparator=++}}",
               "Rainy_Night_4": "Oh hey love, glad you're finally home.$14#$b#Oh, don't worry about it, I just went out for a jog on the rain. It always clears my mind, nothing wrong, I promise.$15#$e#Why don't you help me out of these clothes, and then we can both be feeling wet for the night?$17",  
               "Rainy_Night_5": "If you need anything else from outside, please be sure to tell me, sugarcups.#$b#I'd rather you not have to go outside and wet yourself, you've worked hard enough already.#$e#Why don't you lay down so I can give you a massage if there's nothing else you need?#$e#Just a massage, I swear it!$13",
               "Good_8": "{{Random:For some reason, I was feeling a little off today. But when you came along, you definitely turned me on.$10 ++ Woah there, cowboy. Did the sun come out or did you just smile at me?$10^Woah there, sugar. Did the sun come out or did you just smile at me?$10#$b#I swear, if it weren't for that damned sun you'd be the hottest thing alive today.$10 |inputSeparator=++}}",
               "Indoor_Night_2": "{{Random:You must be exhausted love, because you've been running through my mind all day.#$b#%Sterling pulls you in for a quick kiss.#$b#How about I make dinner tonight? ++ Hey darling, I bought you a little something...$4#$b#Would you maybe wear it for me tonight?$4 |inputSeparator=++}}",
               "Good_9": "Hey lover! Why did the ketchup blush?$10#$b#He saw the salad dressing!$13#$e#Speaking off, do you need any help with those clothes?$10"
               
            }
            
            //(0 = up, 1 = right, 2 = down, 3 = left)
            
        }
    ]
}